{
    "0483": {
        "name": "Sistemas Informáticos",
        "code": "0483",
        "hours": "100",
        "ects": "10",
        "learning_results": [
            {
                "id": "1",
                "description": "Evalúa sistemas informáticos, identificando sus componentes y características.",
                "evaluation_criteria": [
                    "a) Se han reconocido los componentes físicos de un sistema informático y sus mecanismos de interconexión.",
                    "b) Se han clasificado los tipos de memorias, señalando sus características e identifcando sus prestaciones y la función que desarrollan en el conjunto del sistema.",
                    "c) Se ha verificado el proceso de puesta en marcha de un equipo.",
                    "d) Se han clasificado, instalado y configurado diferentes tipos de dispositivos periféricos.",
                    "e) Se han identificado los tipos de redes y sistemas de comunicación.",
                    "f) Se han identificado los componentes de una red informática.",
                    "g) Se han interpretado mapas físicos y lógicos de una red informática.",
                    "h) Se han reconocido las normas de seguridad y prevención de riesgos laborales en el uso de los sistemas informáticos."
                ]
            },
            {
                "id": "2",
                "description": "Instala sistemas operativos planificando el proceso e interpretando documentación técnica.",
                "evaluation_criteria": [
                    "a) Se han identificado los elementos funcionales de un sistema informático.",
                    "b) Se han analizado las características, funciones y arquitectura de un sistema operativo.",
                    "c) Se han comparado sistemas operativos en base a sus requisitos, características, campos de aplicación y licencias de uso.",
                    "d) Se ha planificado el proceso de la instalación de sistemas operativos.",
                    "e) Se han instalado y actualizado sistemas operativos libres y propietarios.",
                    "f) Se han aplicado técnicas de actualización y recuperación del sistema.",
                    "g) Se han utilizado tecnologías de virtualización para instalar y probar sistemas operativos.",
                    "h) Se han instalado, desinstalado y actualizado aplicaciones.",
                    "i) Se han documentado los procesos realizados."
                ]
            },
            {
                "id": "3",
                "description": "Gestiona la información del sistema identificando las estructuras de almacenamiento y aplicando medidas para asegurar la integridad de los datos.",
                "evaluation_criteria": [
                    "a) Se han comparado sistemas de archivos.",
                    "b) Se ha identificado la estructura y función de los directorios del sistema",
                    "c) operativo.",
                    "d) Se han utilizado herramientas en entorno gráfico y comandos para localizar información en el sistema de archivos.",
                    "e) Se han creado diferentes tipos de particiones y unidades lógicas.",
                    "f) Se han realizado y restaurado copias de seguridad.",
                    "g) Se han planificado y automatizado tareas.",
                    "h) Se han instalado y evaluado utilidades relacionadas con la gestión de información."
                ]
            },
            {
                "id": "4",
                "description": "Gestiona sistemas operativos utilizando comandos y herramientas gráficas y evaluando las necesidades del sistema.",
                "evaluation_criteria": [
                    "a) Se han configurado cuentas de usuario locales y grupos.",
                    "b) Se ha asegurado el acceso al sistema mediante el uso de directivas de cuenta y directivas de contraseñas.",
                    "c) Se han identificado, arrancado y detenido servicios y procesos.",
                    "d) Se ha protegido el acceso a la información mediante el uso de permisos locales y listas de control de acceso.",
                    "e) Se han utilizado comandos para realizar las tareas básicas de configuración y administración del sistema.",
                    "f) Se ha monitorizado el sistema.",
                    "g) Se han instalado y evaluado utilidades para el mantenimiento y optimización del sistema.",
                    "h) Se han evaluado las necesidades del sistema informático en relación con el desarrollo de aplicaciones."
                ]
            },
            {
                "id": "5",
                "description": "Interconecta sistemas en red configurando dispositivos y protocolos.",
                "evaluation_criteria": [
                    "a) Se ha configurado el protocolo TCP/IP.",
                    "b) Se han configurado redes de área local cableadas.",
                    "c) Se han configurado redes de área local inalámbricas.",
                    "d) Se han utilizado dispositivos de interconexión de redes.",
                    "e) Se ha configurado el acceso a redes de área extensa.",
                    "f) Se han gestionado puertos de comunicaciones.",
                    "g) Se ha verificado el funcionamiento de la red mediante el uso de comandos y herramientas básicas.",
                    "h) Se han aplicado protocolos seguros de comunicaciones."
                ]
            },
            {
                "id": "6",
                "description": "Opera sistemas en red gestionando sus recursos e identificando las restricciones de seguridad existentes.",
                "evaluation_criteria": [
                    "a) Se ha configurado el acceso a recursos locales y recursos de red.",
                    "b) Se han identificado y configurado los derechos de usuario y directivas de seguridad.",
                    "c) Se han explotado servidores de ficheros, servidores de impresión y servidores de aplicaciones.",
                    "d) Se ha accedido a los servidores utilizando técnicas de conexión remota.",
                    "e) Se ha evaluado la necesidad de proteger los recursos y el sistema.",
                    "f) Se han instalado y evaluado utilidades de seguridad básica.",
                    "g) Se han configurado y explotado dominios."
                ]
            },
            {
                "id": "7",
                "description": "Elabora documentación valorando y utilizando aplicaciones informáticas de propósito general.",
                "evaluation_criteria": [
                    "a) Se ha clasificado software en función de su licencia y propósito.",
                    "b) Se han analizado las necesidades específicas de software asociadas al uso de sistemas informáticos en diferentes entornos productivos.",
                    "c) Se han realizado tareas de documentación mediante el uso de herramientas ofimáticas y de trabajo colaborativo.",
                    "d) Se han utilizado sistemas de correo y mensajería electrónica.",
                    "e) Se han utilizado los servicios de transferencia de ficheros.",
                    "f) Se han utilizado métodos de búsqueda de documentación técnica mediante el uso de servicios de Internet.",
                    "g) Se han utilizado herramientas de propósito general."
                ]
            }
        ],
        "contents": [
            "Explotación de sistemas microinformáticos:",
            "−\tPlacas base. Formatos.",
            "−\tEstructura y componentes: procesador (Set de Instrucciones, Registros, Contador, Unidad Aritmético-Lógica, Interrupciones); memoria interna, tipos y características (RAM, xPROM y otras); interfaces de entrada/salida; discos Periféricos. Adaptadores para la conexión de dispositivos. Componentes de un sistema informático.",
            "−\tPeriféricos. Adaptadores para la conexión de dispositivos.",
            "−\tNormas de seguridad y prevención de riesgos laborales.",
            "−\tCaracterísticas de las redes. Ventajas e inconvenientes.",
            "−\tTipos de redes.",
            "−\tComponentes de una red informática.",
            "−\tTopologías de red.",
            "−\tTipos de cableado. Conectores.",
            "−\tMapa físico y lógico de una red local.",
            "Instalación de sistemas operativos:",
            "−\tEvolución histórica y clasificación.",
            "−\tFunciones de un sistema operativo.",
            "−\tTipos de sistemas operativos.",
            "−\tTipos de aplicaciones.",
            "−\tLicencias y tipos de licencias.",
            "−\tProcedimiento de instalación.",
            "−\tGestores de arranque. Configuración y reparación.",
            "−\tTecnologías de virtualización. Tipos.",
            "−\tConsideraciones previas a la instalación de sistemas operativos libres y propietarios.",
            "−\tInstalación de sistemas operativos libres y propietarios. Requisitos, versiones y licencias.",
            "−\tInstalación/desinstalación de aplicaciones. Requisitos, versiones y licencias.",
            "−\tActualización y recuperación de sistemas operativos y aplicaciones.",
            "−\tDocumentación de la instalación y de las incidencias detectadas.",
            "Gestión de la información:",
            "−\tGestión de sistemas de archivos mediante comandos y entornos gráficos.",
            "−\tEstructura de directorios de sistemas operativos libres y propietarios.",
            "−\tBúsqueda de información del sistema mediante comandos y herramientas gráficas.",
            "−\tIdentificación del software instalado mediante comandos y herramientas gráficas.",
            "−\tRealización y restauración de copias de seguridad.",
            "−\tHerramientas de administración de discos. Particiones y volúmenes. Desfragmentación y chequeo. Cifrado.",
            "−\tTareas automáticas. Planificación.",
            "Configuración de sistemas operativos:",
            "−\tConfiguración de usuarios y grupos.",
            "−\tSeguridad de cuentas de usuario.",
            "−\tSeguridad de contraseñas.",
            "−\tAcceso a recursos. Permisos locales. Listas de control de acceso.",
            "−\tServicios y procesos.",
            "−\tComandos de sistemas operativos libres y propietarios.",
            "−\tHerramientas de monitorización del sistema. Registros y logs.",
            "Conexión de sistemas en red:",
            "−\tConfiguración del protocolo TCP/IP en un cliente de red. Direcciones IP. Máscaras de subred. Puertas de enlace. Servidores de nombres de dominio. IPv4. IPv6. Configuración estática. Configuración dinámica automática.",
            "−\tFicheros de configuración de red.",
            "−\tGestión de puertos.",
            "−\tResolución de problemas de conectividad en sistemas operativos en red. Herramientas de diagnóstico.",
            "−\tHerramientas gráficas y comandos utilizados en sistemas operativos libres y propietarios.",
            "−\tMonitorización de redes.",
            "−\tProtocolos TCP/IP.",
            "−\tConfiguración de los adaptadores de red en sistemas operativos libres y propietarios.",
            "−\tInterconexión de redes: adaptadores de red y dispositivos de interconexión. Enrutamiento.",
            "−\tRedes cableadas. Tipos y características. Adaptadores de red. Conmutadores, enrutadores, entre otros. Seguridad.",
            "−\tRedes inalámbricas. Tipos y características. Adaptadores. Dispositivos de interconexión. Seguridad.",
            "−\tSeguridad de comunicaciones.",
            "−\tTecnologías de acceso a redes de área extensa.",
            "Gestión de recursos en una red:",
            "−\tPermisos y derechos. Permisos de red. Permisos locales. Herencia. Listas de control de acceso.",
            "−\tConfiguración de recursos compartidos. Permisos de acceso y directivas de seguridad.",
            "−\tRequisitos de seguridad del sistema y de los datos.",
            "−\tServidores de ficheros.",
            "−\tServidores de impresión.",
            "−\tServidores de aplicaciones.",
            "−\tTécnicas de conexión remota.",
            "−\tCortafuegos.",
            "−\tImplantación y explotación de dominios.",
            "Explotación de aplicaciones informáticas de propósito general:",
            "−\tSoftware: tipos, requisitos, licencias.",
            "−\tHerramientas ofimáticas y de trabajo colaborativo.",
            "−\tUtilidades de propósito general: antimalware, correo, transferencia de ficheros, recuperación de datos, mantenimiento del sistema, entre otros."
        ]
    },
    "0484": {
        "name": "Bases de datos",
        "code": "0484",
        "hours": "105",
        "ects": "11",
        "learning_results": [
            {
                "id": "1",
                "description": "Reconoce los elementos de las bases de datos analizando sus funciones y valorando la utilidad de los sistemas gestores.",
                "evaluation_criteria": [
                    "a) Se han analizado los sistemas lógicos de almacenamiento y sus características.",
                    "b) Se han identificado los distintos tipos de bases de datos según el modelo de datos utilizado.",
                    "c) Se han identificado los distintos tipos de bases de datos en función de la ubicación de la información.",
                    "d) Se ha evaluado la utilidad de un sistema gestor de bases de datos.",
                    "e) Se ha reconocido la función de cada uno de los elementos de un sistema gestor de bases de datos.",
                    "f) Se han clasificado los sistemas gestores de bases de datos.",
                    "g) Se ha reconocido la utilidad de las bases de datos distribuidas.",
                    "h) Se han analizado las políticas de fragmentación de la información.",
                    "i) Se ha identificado la legislación vigente sobre protección de datos.",
                    "j) Se han reconocido los conceptos de Big Data y de la inteligencia de negocios."
                ]
            },
            {
                "id": "2",
                "description": "Crea bases de datos definiendo su estructura y las características de sus elementos según el modelo relacional.",
                "evaluation_criteria": [
                    "a) Se ha analizado el formato de almacenamiento de la información.",
                    "b) Se han creado las tablas y las relaciones entre ellas.",
                    "c) Se han seleccionado los tipos de datos adecuados.",
                    "d) Se han definido los campos clave en las tablas.",
                    "e) Se han implantado las restricciones reflejadas en el diseño lógico.",
                    "f) Se han creado vistas.",
                    "g) Se han creado los usuarios y se les han asignado privilegios.",
                    "h) Se han utilizado asistentes, herramientas gráficas y los lenguajes de definición y control de datos."
                ]
            },
            {
                "id": "3",
                "description": "Consulta la información almacenada en una base de datos empleando asistentes, herramientas gráficas y el lenguaje de manipulación de datos.",
                "evaluation_criteria": [
                    "a) Se han identificado las herramientas y sentencias para realizar consultas.",
                    "b) Se han realizado consultas simples sobre una tabla.",
                    "c) Se han realizado consultas sobre el contenido de varias tablas mediante composiciones internas.",
                    "d) Se han realizado consultas sobre el contenido de varias tablas mediante composiciones externas.",
                    "e) Se han realizado consultas resumen.",
                    "f) Se han realizado consultas con subconsultas.",
                    "g) Se han realizado consultas que implican múltiples selecciones.",
                    "h) Se han aplicado criterios de optimización de consultas."
                ]
            },
            {
                "id": "4",
                "description": "Modifica la información almacenada en la base de datos utilizando asistentes, herramientas gráficas y el lenguaje de manipulación de datos.",
                "evaluation_criteria": [
                    "a) Se han identificado las herramientas y sentencias para modificar el contenido de la base de datos.",
                    "b) Se han insertado, borrado y actualizado datos en las tablas.",
                    "c) Se ha incluido en una tabla la información resultante de la ejecución de una consulta.",
                    "d) Se han diseñado guiones de sentencias para llevar a cabo tareas complejas.",
                    "e) Se ha reconocido el funcionamiento de las transacciones.",
                    "f) Se han anulado parcial o totalmente los cambios producidos por una transacción.",
                    "g) Se han identificado los efectos de las distintas políticas de bloqueo de registros.",
                    "h) Se han adoptado medidas para mantener la integridad y consistencia de la información."
                ]
            },
            {
                "id": "5",
                "description": "Desarrolla procedimientos almacenados evaluando y utilizando las sentencias del lenguaje incorporado en el sistema gestor de bases de datos.",
                "evaluation_criteria": [
                    "a) Se han identificado las diversas formas de automatizar tareas.",
                    "b) Se han reconocido los métodos de ejecución de guiones.",
                    "c) Se han identificado las herramientas disponibles para editar guiones.",
                    "d) Se han definido y utilizado guiones para automatizar tareas.",
                    "e) Se ha hecho uso de las funciones proporcionadas por el sistema gestor.",
                    "f) Se han definido procedimientos y funciones de usuario.",
                    "g) Se han utilizado estructuras de control de flujo.",
                    "h) Se han definido eventos y disparadores.",
                    "i) Se han utilizado cursores.",
                    "j) Se han utilizado excepciones."
                ]
            },
            {
                "id": "6",
                "description": "Diseña modelos relacionales normalizados interpretando diagramas entidad/relación.",
                "evaluation_criteria": [
                    "a) Se han utilizado herramientas gráficas para representar el diseño lógico.",
                    "b) Se han identificado las tablas del diseño lógico.",
                    "c) Se han identificado los campos que forman parte de las tablas del diseño lógico.",
                    "d) Se han analizado las relaciones entre las tablas del diseño lógico.",
                    "e) Se han identificado los campos clave.",
                    "f) Se han aplicado reglas de integridad.",
                    "g) Se han aplicado reglas de normalización.",
                    "h) Se han analizado y documentado las restricciones que no pueden plasmarse en el diseño lógico."
                ]
            },
            {
                "id": "7",
                "description": "Gestiona la información almacenada en bases de datos no relacionales, evaluando y utilizando las posibilidades que proporciona el sistema gestor.",
                "evaluation_criteria": [
                    "a) Se han caracterizado las bases de datos no relacionales.",
                    "b) Se han evaluado los principales tipos de bases de datos no relacionales.",
                    "c) Se han identificado los elementos utilizados en estas bases de datos.",
                    "d) Se han identificado distintas formas de gestión de la información según el tipo de base de datos no relacionales.",
                    "e) Se han utilizado las herramientas del sistema gestor para la gestión de la información almacenada."
                ]
            }
        ],
        "contents": [
            "Almacenamiento de la información:",
            "−\tFicheros (planos, indexados, acceso directo, entre otros).",
            "−\tBases de datos. Conceptos, usos y tipos según el modelo de datos, la ubicación de la información.",
            "−\tSistemas gestores de base de datos: Funciones, componentes y tipos.",
            "−\tBases de datos centralizadas y bases de datos distribuidas. Técnicas de fragmentación.",
            "−\tLegislación sobre protección de datos.",
            "−\tBig Data: introducción, análisis de datos, inteligencia de negocios.",
            "Bases de datos relacionales:",
            "−\tModelo de datos.",
            "−\tTerminología del modelo relacional.",
            "−\tTipos de datos.",
            "−\tClaves primarias.",
            "−\tRestricciones de validación.",
            "−\tÍndices. Características.",
            "−\tEl valor NULL.",
            "−\tClaves ajenas.",
            "−\tVistas.",
            "−\tUsuarios. Privilegios.",
            "−\tLenguaje de descripción de datos (DDL).",
            "−\tLenguaje de control de datos (DCL).",
            "Realización de consultas:",
            "−\tProyección, selección y ordenación de registros.",
            "−\tOperadores. Operadores de comparación. Operadores lógicos.",
            "−\tConsultas de resumen.",
            "−\tAgrupamiento de registros.",
            "−\tComposiciones internas.",
            "−\tComposiciones externas.",
            "−\tSubconsultas.",
            "−\tCombinación de múltiples selecciones.",
            "−\tOptimización de consultas.",
            "Tratamiento de datos:",
            "−\tInserción, borrado y modificación de registros.",
            "−\tIntegridad referencial.",
            "−\tSubconsultas y composiciones en órdenes de edición.",
            "−\tTransacciones.",
            "−\tPolíticas de bloqueo. Concurrencia.",
            "Programación de bases de datos:",
            "−\tIntroducción. Lenguaje de programación.",
            "−\tVariables del sistema y variables de usuario.",
            "−\tFunciones.",
            "−\tEstructuras de control de flujo.",
            "−\tProcedimientos almacenados. Funciones de usuario.",
            "−\tEventos y disparadores.",
            "−\tExcepciones.",
            "−\tCursores.",
            "Interpretación de Diagramas Entidad/Relación:",
            "−\tEl modelo E/R. Entidades y relaciones. Cardinalidades. Debilidad.",
            "−\tEl modelo E/R ampliado. Generalización y especialización. Agregación.",
            "−\tPaso del diagrama E/R al modelo relacional.",
            "−\tRestricciones semánticas del modelo relacional.",
            "−\tNormalización de modelos relacionales.",
            "Uso de bases de datos no relacionales:",
            "−\tCaracterísticas de las bases de datos no relacionales.",
            "−\tTipos de bases de datos no relacionales.",
            "−\tElementos de las bases de datos no relacionales.",
            "−\tSistemas gestores de bases de datos no relacionales.",
            "−\tHerramientas de los sistemas gestores de bases de datos no relacionales para la gestión de la información almacenada."
        ]
    },
    "0485": {
        "name": "Programación",
        "code": "0485",
        "hours": "135",
        "ects": "14",
        "learning_results": [
            {
                "id": "1",
                "description": "Reconoce la estructura de un programa informático, identificando y relacionando los elementos propios del lenguaje de programación utilizado.",
                "evaluation_criteria": [
                    "a) Se han identificado los bloques que componen la estructura de un programa informático.",
                    "b) Se han creado proyectos de desarrollo de aplicaciones.",
                    "c) Se han utilizado entornos integrados de desarrollo.",
                    "d) Se han identificado los distintos tipos de variables y la utilidad específica de cada uno.",
                    "e) Se ha modificado el código de un programa para crear y utilizar variables.",
                    "f) Se han creado y utilizado constantes y literales.",
                    "g) Se han clasificado, reconocido y utilizado en expresiones los operadores del lenguaje.",
                    "h) Se ha comprobado el funcionamiento de las conversiones de tipo explícitas e implícitas.",
                    "i) Se han introducido comentarios en el código."
                ]
            },
            {
                "id": "2",
                "description": "Escribe y prueba programas sencillos, reconociendo y aplicando los fundamentos de la programación orientada a objetos.",
                "evaluation_criteria": [
                    "a) Se han identificado los fundamentos de la programación orientada a objetos.",
                    "b) Se han escrito programas simples.",
                    "c) Se han instanciado objetos a partir de clases predefinidas.",
                    "d) Se han utilizado métodos y propiedades de los objetos.",
                    "e) Se han escrito llamadas a métodos estáticos.",
                    "f) Se han utilizado parámetros en la llamada a métodos.",
                    "g) Se han incorporado y utilizado librerías de objetos.",
                    "h) Se han utilizado constructores.",
                    "i) Se ha utilizado el entorno integrado de desarrollo en la creación y compilación de programas simples."
                ]
            },
            {
                "id": "3",
                "description": "Escribe y depura código, analizando y utilizando las estructuras de control del lenguaje.",
                "evaluation_criteria": [
                    "a) Se ha escrito y probado código que haga uso de estructuras de selección.",
                    "b) Se han utilizado estructuras de repetición.",
                    "c) Se han reconocido las posibilidades de las sentencias de salto.",
                    "d) Se ha escrito código utilizando control de excepciones.",
                    "e) Se han creado programas ejecutables utilizando diferentes estructuras de control.",
                    "f) Se han probado y depurado los programas.",
                    "g) Se ha comentado y documentado el código.",
                    "h) Se han creado excepciones.",
                    "i) Se han utilizado aserciones para la detección y corrección de errores durante la fase de desarrollo."
                ]
            },
            {
                "id": "4",
                "description": "Desarrolla programas organizados en clases analizando y aplicando los principios de la programación orientada a objetos.",
                "evaluation_criteria": [
                    "a) Se ha reconocido la sintaxis, estructura y componentes típicos de una clase.",
                    "b) Se han definido clases.",
                    "c) Se han definido propiedades y métodos.",
                    "d) Se han creado constructores.",
                    "e) Se han desarrollado programas que instancien y utilicen objetos de las clases creadas anteriormente.",
                    "f) Se han utilizado mecanismos para controlar la visibilidad de las clases y de sus miembros.",
                    "g) Se han definido y utilizado clases heredadas.",
                    "h) Se han creado y utilizado métodos estáticos.",
                    "i) Se han creado y utilizado conjuntos y librerías de clases."
                ]
            },
            {
                "id": "5",
                "description": "Realiza operaciones de entrada y salida de información, utilizando procedimientos específicos del lenguaje y librerías de clases.",
                "evaluation_criteria": [
                    "a) Se ha utilizado la consola para realizar operaciones de entrada y salida de información.",
                    "b) Se han aplicado formatos en la visualización de la información.",
                    "c) Se han reconocido las posibilidades de entrada / salida del lenguaje y las librerías asociadas.",
                    "d) Se han utilizado ficheros para almacenar y recuperar información.",
                    "e) Se han creado programas que utilicen diversos métodos de acceso al contenido de los ficheros.",
                    "f) Se han utilizado las herramientas del entorno de desarrollo para crear interfaces gráficos de usuario simples.",
                    "g) Se han programado controladores de eventos.",
                    "h) Se han escrito programas que utilicen interfaces gráficos para la entrada y salida de información."
                ]
            },
            {
                "id": "6",
                "description": "Escribe programas que manipulen información seleccionando y utilizando tipos avanzados de datos.",
                "evaluation_criteria": [
                    "a) Se han escrito programas que utilicen matrices (arrays).",
                    "b) Se han reconocido las librerías de clases relacionadas con tipos de datos avanzados.",
                    "c) Se han utilizado listas para almacenar y procesar información.",
                    "d) Se han utilizado iteradores para recorrer los elementos de las listas.",
                    "e) Se han reconocido las características y ventajas de cada una de las colecciones de datos disponibles.",
                    "f) Se han creado clases y métodos genéricos.",
                    "g) Se han utilizado expresiones regulares en la búsqueda de patrones en cadenas de texto.",
                    "h) Se han identificado las clases relacionadas con el tratamiento de documentos escritos en diferentes lenguajes de intercambio de datos.",
                    "i) Se han realizado programas que realicen manipulaciones sobre documentos escritos en diferentes lenguajes de intercambio de datos.",
                    "j) Se han utilizado operaciones agregadas para el manejo de información almacenada en colecciones."
                ]
            },
            {
                "id": "7",
                "description": "Desarrolla programas aplicando características avanzadas de los lenguajes orientados a objetos y del entorno de programación.",
                "evaluation_criteria": [
                    "a) Se han identificado los conceptos de herencia, superclase y subclase.",
                    "b) Se han utilizado modificadores para bloquear y forzar la herencia de clases y métodos.",
                    "c) Se ha reconocido la incidencia de los constructores en la herencia.",
                    "d) Se han creado clases heredadas que sobrescriben la implementación de métodos de la superclase.",
                    "e) Se han diseñado y aplicado jerarquías de clases.",
                    "f) Se han probado y depurado las jerarquías de clases.",
                    "g) Se han realizado programas que implementen y utilicen jerarquías de clases.",
                    "h) Se ha comentado y documentado el código.",
                    "i) Se han identificado y evaluado los escenarios de uso de interfaces.",
                    "j) Se han identificado y evaluado los escenarios de utilización de la herencia y la composición."
                ]
            },
            {
                "id": "8",
                "description": "Utiliza bases de datos orientadas a objetos, analizando sus características y aplicando técnicas para mantener la persistencia de la información.",
                "evaluation_criteria": [
                    "a) Se han identificado las características de las bases de datos orientadas a objetos.",
                    "b) Se ha analizado su aplicación en el desarrollo de aplicaciones mediante lenguajes orientados a objetos.",
                    "c) Se han instalado sistemas gestores de bases de datos orientados a objetos.",
                    "d) Se han clasificado y analizado los distintos métodos soportados por los sistemas gestores para la gestión de la información almacenada.",
                    "e) Se han creado bases de datos y las estructuras necesarias para el almacenamiento de objetos.",
                    "f) Se han programado aplicaciones que almacenen objetos en las bases de datos creadas.",
                    "g) Se han realizado programas para recuperar, actualizar y eliminar objetos de las bases de datos.",
                    "h) Se han realizado programas para almacenar y gestionar tipos de datos estructurados, compuestos y relacionados."
                ]
            },
            {
                "id": "9",
                "description": "Gestiona información almacenada en bases de datos manteniendo la integridad y consistencia de los datos.",
                "evaluation_criteria": [
                    "a) Se han identificado las características y métodos de acceso a sistemas gestores de bases de datos.",
                    "b) Se han programado conexiones con bases de datos.",
                    "c) Se ha escrito código para almacenar información en bases de datos.",
                    "d) Se han creado programas para recuperar y mostrar información almacenada en bases de datos.",
                    "e) Se han efectuado borrados y modificaciones sobre la información almacenada.",
                    "f) Se han creado aplicaciones que muestren la información almacenada en bases de datos.",
                    "g) Se han creado aplicaciones para gestionar la información presente en bases de datos."
                ]
            }
        ],
        "contents": [
            "Identificación de los elementos de un programa informático:",
            "−\tEstructura y bloques fundamentales.",
            "−\tVariables.",
            "−\tTipos de datos.",
            "−\tLiterales.",
            "−\tConstantes.",
            "−\tOperadores y expresiones.",
            "−\tConversiones de tipo.",
            "−\tComentarios.",
            "Utilización de objetos:",
            "−\tCaracterísticas de los objetos.",
            "−\tInstanciación de objetos.",
            "−\tUtilización de métodos. Parámetros.",
            "−\tUtilización de propiedades.",
            "−\tUtilización de métodos estáticos.",
            "−\tConstructores.",
            "−\tDestrucción de objetos y liberación de memoria.",
            "Uso de estructuras de control:",
            "−\tEstructuras de selección.",
            "−\tEstructuras de repetición.",
            "−\tEstructuras de salto.",
            "−\tControl de excepciones.",
            "−\tAserciones.",
            "−\tPrueba, depuración y documentación de la aplicación.",
            "Desarrollo de clases:",
            "−\tConcepto de clase.",
            "−\tEstructura y miembros de una clase. Visibilidad.",
            "−\tCreación de propiedades.",
            "−\tCreación de métodos.",
            "−\tCreación de constructores.",
            "−\tUtilización de clases y objetos.",
            "−\tUtilización de clases heredadas.",
            "Lectura y escritura de información:",
            "−\tFlujos. Tipos: bytes y caracteres. Clases relacionadas.",
            "−\tFicheros de datos. Registros.",
            "−\tApertura y cierre de ficheros. Modos de acceso. Escritura y lectura de información en ficheros.",
            "−\tUtilización de los sistemas de ficheros.",
            "−\tCreación y eliminación de ficheros y directorios.",
            "−\tEntrada desde teclado. Salida a pantalla. Formatos de visualización.",
            "−\tInterfaces gráficas.",
            "−\tConcepto de evento.",
            "−\tCreación de controladores de eventos.",
            "Aplicación de las estructuras de almacenamiento:",
            "−\tEstructuras estáticas y dinámicas.",
            "−\tCreación de matrices (arrays).",
            "−\tMatrices (arrays) multidimensionales.",
            "−\tGenericidad.",
            "−\tCadenas de caracteres. Expresiones regulares.",
            "−\tColecciones: Listas, Conjuntos y Diccionarios.",
            "−\tOperaciones agregadas: filtrado, reducción y recolección.",
            "Utilización avanzada de clases:",
            "−\tComposición de clases.",
            "−\tHerencia y polimorfismo.",
            "−\tJerarquía de clases: Superclases y subclases.",
            "−\tClases y métodos abstractos y finales.",
            "−\tInterfaces.",
            "−\tSobreescritura de métodos.",
            "−\tConstructores y herencia.",
            "Mantenimiento de la persistencia de los objetos:",
            "−\tBases de datos orientadas a objetos.",
            "−\tCaracterísticas de las bases de datos orientadas a objetos.",
            "−\tInstalación del gestor de bases de datos.",
            "−\tCreación de bases de datos.",
            "−\tMecanismos de consulta.",
            "−\tEl lenguaje de consultas: sintaxis, expresiones, operadores.",
            "−\tRecuperación, modificación y borrado de información.",
            "−\tTipos de datos objeto; atributos y métodos.",
            "−\tTipos de datos colección.",
            "Gestión de bases de datos:",
            "−\tAcceso a bases de datos. Estándares. Características.",
            "−\tEstablecimiento de conexiones.",
            "−\tAlmacenamiento, recuperación, actualización y eliminación de información en bases de datos."
        ]
    },
    "0373": {
        "name": "Lenguajes de marcas y sistemas de gestión de información",
        "code": "0373",
        "hours": "70",
        "ects": "7",
        "learning_results": [
            {
                "id": "1",
                "description": "Reconoce las características de lenguajes de marcas analizando e interpretando fragmentos de código.",
                "evaluation_criteria": [
                    "a) Se han identificado las características generales de los lenguajes de marcas.",
                    "b) Se han reconocido las ventajas que proporcionan en el tratamiento de la información.",
                    "c) Se han clasificado los lenguajes de marcas e identificado los más relevantes.",
                    "d) Se han diferenciado sus ámbitos de aplicación.",
                    "e) Se han reconocido la necesidad y los ámbitos específicos de aplicación de un lenguaje de marcas de propósito general.",
                    "f) Se han analizado las características propias de diferentes lenguajes de marcas.",
                    "g) Se han identificado la estructura de un documento y sus reglas sintácticas.",
                    "h) Se han contrastado la necesidad de crear documentos bien formados y la influencia en su procesamiento.",
                    "i) Se han identificado las ventajas que aportan los espacios de nombres."
                ]
            },
            {
                "id": "2",
                "description": "Utiliza lenguajes de marcas para la transmisión y presentación de información a través de la web analizando la estructura de los documentos e identificando sus elementos.",
                "evaluation_criteria": [
                    "a) Se han identificado y clasificado los lenguajes de marcas relacionados con la web y sus diferentes versiones y estándares.",
                    "b) Se ha analizado la estructura de un documento HTML e identificado las secciones que lo componen.",
                    "c) Se han reconocido la funcionalidad de las principales etiquetas y los atributos del lenguaje HTML.",
                    "d) Se han establecido las semejanzas y diferencias entre las diferentes versiones de HTML.",
                    "e) Se han utilizado herramientas en la creación de documentos web.",
                    "f) Se han identificado las ventajas que aporta la utilización de hojas de estilo.",
                    "g) Se han aplicado hojas de estilo.",
                    "h) Se han validado documentos HTML y CSS.",
                    "i) Se han identificado las tecnologías en que se basa la sindicación de contenidos.",
                    "j) Se han reconocido los ámbitos de aplicación de la sindicación de contenidos."
                ]
            },
            {
                "id": "3",
                "description": "Accede y manipula documentos web utilizando lenguajes de script de cliente.",
                "evaluation_criteria": [
                    "a) Se han identificado y clasificado los lenguajes de script de cliente relacionados con la web y sus diferentes versiones y estándares.",
                    "b) Se ha identificado la sintaxis básica de los lenguajes de script de cliente.",
                    "c) Se han utilizado métodos para la selección y acceso de los diferentes elementos de un documento web.",
                    "d) Se han creado y modificado elementos de documentos web.",
                    "e) Se han eliminado elementos de documentos web.",
                    "f) Se han realizado modificaciones sobre los estilos de un documento web."
                ]
            },
            {
                "id": "4",
                "description": "Establece mecanismos de validación de documentos para el intercambio de información utilizando métodos para definir su sintaxis y estructura.",
                "evaluation_criteria": [
                    "a) Se ha establecido la necesidad de describir la información transmitida en los documentos y sus reglas.",
                    "b) Se han identificado las tecnologías relacionadas con la definición de documentos.",
                    "c) Se ha analizado la estructura y sintaxis específica utilizada en la descripción.",
                    "d) Se han creado descripciones de documentos.",
                    "e) Se han utilizado descripciones en la elaboración y validación de documentos.",
                    "f) Se han asociado las descripciones con los documentos.",
                    "g) Se han utilizado herramientas específicas."
                ]
            },
            {
                "id": "5",
                "description": "Realiza conversiones sobre documentos para el intercambio de información utilizando técnicas, lenguajes y herramientas de procesamiento.",
                "evaluation_criteria": [
                    "a) Se ha identificado la necesidad de la conversión de documentos para el intercambio de la información.",
                    "b) Se han establecido ámbitos de aplicación.",
                    "c) Se han analizado las tecnologías implicadas y su modo de funcionamiento.",
                    "d) Se ha descrito la sintaxis específica utilizada en la conversión y adaptación de documentos para el intercambio de información.",
                    "e) Se han creado especificaciones de conversión.",
                    "f) Se han identificado y caracterizado herramientas específicas relacionadas con la conversión de documentos para el intercambio de información.",
                    "g) Se han realizado conversiones sobre documentos para el intercambio de información."
                ]
            },
            {
                "id": "6",
                "description": "Gestiona la información en formatos de intercambio de datos analizando y utilizando tecnologías de almacenamiento y lenguajes de consulta.",
                "evaluation_criteria": [
                    "a) Se han identificado los principales métodos de almacenamiento de la información utilizados en documentos de intercambio de datos.",
                    "b) Se han identificado las ventajas e inconvenientes de almacenar información en formatos de intercambio de datos.",
                    "c) Se han establecido tecnologías eficientes de almacenamiento de información en función de sus características.",
                    "d) Se han identificado lenguajes y herramientas para el tratamiento y almacenamiento de información y su inclusión en documentos de intercambio de datos.",
                    "e) Se han utilizado lenguajes de consulta y manipulación en documentos de intercambio de datos.",
                    "f) Se han utilizado sistemas gestores de bases de datos relacionales en el almacenamiento de información en formatos de intercambio de datos.",
                    "g) Se han utilizado técnicas específicas para crear documentos de intercambio de datos a partir de información almacenada en bases de datos relacionales.",
                    "h) Se han identificado las características de los sistemas.",
                    "i) Se han utilizado herramientas para gestionar la información almacenada en bases de datos nativas."
                ]
            },
            {
                "id": "7",
                "description": "Opera sistemas empresariales de gestión de información realizando tareas de importación, integración, aseguramiento y extracción de la información.",
                "evaluation_criteria": [
                    "a) Se han identificado los principales sistemas de gestión empresarial.",
                    "b) Se han reconocido las ventajas de los sistemas de gestión de información empresariales.",
                    "c) Se han evaluado las características de las principales aplicaciones de gestión empresarial.",
                    "d) Se han instalado aplicaciones de gestión de la información empresarial.",
                    "e) Se han configurado y administrado las aplicaciones.",
                    "f) Se han establecido y verificado mecanismos de acceso seguro a la información.",
                    "g) Se han generado informes.",
                    "h) Se han realizado procedimientos de extracción de información para su tratamiento e incorporación a diversos sistemas.",
                    "i) Se han elaborado documentos relativos a la explotación de la aplicación."
                ]
            }
        ],
        "contents": [
            "Reconocimiento de las características de lenguajes de marcas:",
            "−\tClasificación.",
            "−\tCaracterísticas y ámbitos de aplicación.",
            "−\tEstructura y sintaxis.",
            "−\tHerramientas de edición.",
            "−\tElaboración de documentos bien formados.",
            "−\tUtilización de espacios de nombres.",
            "Utilización de lenguajes de marcas en entornos web:",
            "−\tEstándares web. Versiones. Clasificación.",
            "−\tEstructura de un documento HTML.",
            "−\tIdentificación de etiquetas y atributos de HTML.",
            "−\tHerramientas de diseño web.",
            "−\tHojas de estilo (CSS).",
            "−\tValidación de documentos HTML y CSS.",
            "−\tLenguajes de marcas para la sindicación de contenidos.",
            "Manipulación de documentos web:",
            "−\tLenguajes de script de cliente. Características y sintaxis básica. Estándares.",
            "−\tSelección y acceso a elementos.",
            "−\tCreación y modificación de elementos.",
            "−\tEliminación de elementos.",
            "−\tManipulación de estilos.",
            "Definición de esquemas y vocabularios en lenguajes de marcas:",
            "−\tTecnologías para la definición de documentos. Estructura y sintaxis.",
            "−\tCreación de descripciones de documentos.",
            "−\tAsociación de descripciones con documentos. Validación.",
            "−\tHerramientas de creación y validación.",
            "Conversión y adaptación de documentos para el intercambio de información:",
            "−\tTecnologías de transformación de documentos. Estándares. Ámbitos de aplicación.",
            "−\tDescripción de la estructura y de la sintaxis.",
            "−\tCreación y utilización de plantillas. Herramientas y depuración.",
            "−\tConversión entre diferentes formatos de documentos.",
            "Almacenamiento de información:",
            "−\tSistemas de almacenamiento de información. Características. Tecnologías.",
            "−\tLenguajes de consulta y manipulación en documentos.",
            "−\tConsulta y manipulación de información.",
            "−\tImportación y exportación de bases de datos relacionales en diferentes formatos.",
            "−\tHerramientas de tratamiento y almacenamiento de información en sistemas nativos.",
            "−\tAlmacenamiento y manipulación de información en sistemas nativos.",
            "Sistemas de gestión empresarial:",
            "−\tAplicaciones de gestión empresarial. Tipos. Características.",
            "−\tInstalación.",
            "−\tAdministración y configuración.",
            "−\tIntegración de módulos.",
            "−\tMecanismos de acceso seguro a la información. Roles y privilegios.",
            "−\tElaboración de informes.",
            "−\tExportación de información.",
            "−\tElaboración de documentación."
        ]
    },
    "0487": {
        "name": "Entornos de Desarrollo",
        "code": "0487",
        "hours": "50",
        "ects": "6",
        "learning_results": [
            {
                "id": "1",
                "description": "Reconoce los elementos y herramientas que intervienen en el desarrollo de un programa informático, analizando sus características y las fases en las que actúan hasta llegar a su puesta en funcionamiento.",
                "evaluation_criteria": [
                    "a) Se ha reconocido la relación de los programas con los componentes del sistema informático: memoria, procesador, periféricos, entre otros.",
                    "b) Se han identificado las fases de desarrollo de una aplicación informática.",
                    "c) Se han diferenciado los conceptos de código fuente, objeto y ejecutable.",
                    "d) Se han reconocido las características de la generación de código intermedio para su ejecución en máquinas virtuales.",
                    "e) Se han clasificado los lenguajes de programación, identificando sus características.",
                    "f) Se ha evaluado la funcionalidad ofrecida por las herramientas utilizadas en el desarrollo de software.",
                    "g) Se han identificado las características y escenarios de uso de las metodologías ágiles de desarrollo de software."
                ]
            },
            {
                "id": "2",
                "description": "Evalúa entornos integrados de desarrollo analizando sus características para editar código fuente y generar ejecutables.",
                "evaluation_criteria": [
                    "a) Se han instalado entornos de desarrollo, propietarios y libres.",
                    "b) Se han añadido y eliminado módulos en el entorno de desarrollo.",
                    "c) Se ha personalizado y automatizado el entorno de desarrollo.",
                    "d) Se ha configurado el sistema de actualización del entorno de desarrollo.",
                    "e) Se han generado ejecutables a partir de código fuente de diferentes lenguajes en un mismo entorno de desarrollo.",
                    "f) Se han generado ejecutables a partir de un mismo código fuente con varios entornos de desarrollo.",
                    "g) Se han identificado las características comunes y específicas de diversos entornos de desarrollo."
                ]
            },
            {
                "id": "3",
                "description": "Verifica el funcionamiento de programas diseñando y realizando pruebas.",
                "evaluation_criteria": [
                    "a) Se han identificado los diferentes tipos de pruebas.",
                    "b) Se han definido casos de prueba.",
                    "c) Se han identificado las herramientas de depuración y prueba de aplicaciones",
                    "d) ofrecidas por el entorno de desarrollo.",
                    "e) Se han utilizado herramientas de depuración para definir puntos de ruptura y seguimiento.",
                    "f) Se han utilizado las herramientas de depuración para examinar y modificar el comportamiento de un programa en tiempo de ejecución.",
                    "g) Se han efectuado pruebas unitarias de clases y funciones.",
                    "h) Se han implementado pruebas automáticas.",
                    "i) Se han documentado las incidencias detectadas.",
                    "j) Se han utilizado dobles de prueba para aislar los componentes durante las pruebas."
                ]
            },
            {
                "id": "4",
                "description": "Optimiza código empleando las herramientas disponibles en el entorno de desarrollo.",
                "evaluation_criteria": [
                    "a) Se han identificado los patrones de refactorización más usuales.",
                    "b) Se han elaborado las pruebas asociadas a la refactorización.",
                    "c) Se ha revisado el código fuente usando un analizador de código.",
                    "d) Se han identificado las posibilidades de configuración de un analizador de código.",
                    "e) Se han aplicado patrones de refactorización con las herramientas que proporciona el entorno de desarrollo.",
                    "f) Se ha realizado el control de versiones integrado en el entorno de desarrollo.",
                    "g) Se han utilizado herramientas del entorno de desarrollo para documentar las clases.",
                    "h) Se han utilizado repositorios remotos para el desarrollo de código colaborativo.",
                    "i) Se han utilizado herramientas para la integración continua del código."
                ]
            },
            {
                "id": "5",
                "description": "Genera diagramas de clases valorando su importancia en el desarrollo de aplicaciones y empleando herramientas específicas.",
                "evaluation_criteria": [
                    "a) Se han identificado los conceptos básicos de la programación orientada a objetos.",
                    "b) Se han utilizado herramientas para la elaboración de diagramas de clases.",
                    "c) Se ha interpretado el significado de diagramas de clases.",
                    "d) Se han trazado diagramas de clases a partir de las especificaciones de las mismas.",
                    "e) Se ha generado código a partir de un diagrama de clases.",
                    "f) Se ha generado un diagrama de clases mediante ingeniería inversa."
                ]
            },
            {
                "id": "6",
                "description": "Genera diagramas de comportamiento valorando su importancia en el desarrollo de aplicaciones y empleando herramientas específicas.",
                "evaluation_criteria": [
                    "a) Se han identificado los distintos tipos de diagramas de comportamiento.",
                    "b) Se ha reconocido el significado de los diagramas de casos de uso.",
                    "c) Se han interpretado diagramas de interacción.",
                    "d) Se han elaborado diagramas de interacción sencillos.",
                    "e) Se ha interpretado el significado de diagramas de actividades.",
                    "f) Se han elaborado diagramas de actividades sencillos.",
                    "g) Se han interpretado diagramas de estados.",
                    "h) Se han planteado diagramas de estados sencillos."
                ]
            }
        ],
        "contents": [
            "Desarrollo de software:",
            "−\tConcepto de programa informático.",
            "−\tCódigo fuente, código objeto y código ejecutable; tecnologías de virtualización.",
            "−\tTipos de lenguajes de programación. Paradigmas.",
            "−\tCaracterísticas de los lenguajes más difundidos.",
            "−\tFases del desarrollo de una aplicación: análisis, diseño, codificación, pruebas, documentación, explotación y mantenimiento, entre otras.",
            "−\tProceso de obtención de código ejecutable a partir del código fuente; herramientas implicadas.",
            "−\tMetodologías ágiles. Técnicas. Características.",
            "Instalación y uso de entornos de desarrollo:",
            "−\tFunciones de un entorno de desarrollo.",
            "−\tInstalación de un entorno de desarrollo.",
            "−\tUso básico de un entorno de desarrollo.",
            "−\tPersonalización del entorno de desarrollo: temas, estilos de codificación, módulos y extensiones, entre otros.",
            "−\tEdición de programas.",
            "−\tGeneración de ejecutables en distintos entornos.",
            "−\tHerramientas y automatización.",
            "Diseño y realización de pruebas:",
            "−\tPlanificación de Pruebas.",
            "−\tTipos de pruebas: Funcionales, estructurales, regresión, entre otras.",
            "−\tProcedimientos y casos de prueba.",
            "−\tPruebas de Código: Cubrimiento, valores límite, clases de equivalencia, entre otras.",
            "−\tPruebas unitarias; herramientas de automatización.",
            "−\tDocumentación de las incidencias.",
            "−\tDobles de prueba. Tipos. Características.",
            "Optimización y documentación:",
            "−\tRefactorización. Concepto. Limitaciones. Patrones de refactorización más usuales. Refactorización y pruebas. Herramientas de ayuda a la refactorización.",
            "−\tAnalizadores de código.",
            "−\tControl de versiones. Estructura de las herramientas de control de versiones. Repositorio. Herramientas de control de versiones. Uso integrado en el entorno de desarrollo.",
            "−\tRepositorios remotos.",
            "−\tDocumentación. Uso de comentarios. Alternativas.",
            "−\tIntegración continua. Herramientas.",
            "Elaboración de diagramas de clases:",
            "−\tClases. Atributos, métodos y visibilidad.",
            "−\tObjetos. Instanciación.",
            "−\tRelaciones. Asociación, navegabilidad y multiplicidad. Herencia, composición, agregación. Realización y dependencia.",
            "−\tNotación de los diagramas de clases.",
            "−\tHerramientas.",
            "−\tGeneración automática de código. Ingeniería inversa.",
            "Elaboración de diagramas de comportamiento:",
            "−\tTipos. Campo de aplicación.",
            "−\tDiagrama de casos de uso. Actores, escenario, relación de comunicación.",
            "−\tDiagrama de secuencia. Línea de vida de un objeto, activación, envío de mensajes.",
            "−\tDiagrama de comunicación. Objetos, mensajes.",
            "−\tDiagrama de actividad. Diagrama de estados."
        ]
    },
    "0486": {
        "name": "Acceso a datos",
        "code": "0486",
        "hours": "80",
        "ects": "9",
        "learning_results": [
            {
                "id": "1",
                "description": "Desarrolla aplicaciones que gestionan información almacenada en ficheros identificando el campo de aplicación de los mismos y utilizando clases específicas.",
                "evaluation_criteria": [
                    "a) Se han utilizado clases para la gestión de ficheros y directorios.",
                    "b) Se han valorado las ventajas y los inconvenientes de las distintas formas de acceso.",
                    "c) Se han utilizado clases para recuperar información almacenada en ficheros.",
                    "d) Se han utilizado clases para almacenar información en ficheros.",
                    "e) Se han utilizado clases para realizar conversiones entre diferentes formatos de ficheros.",
                    "f) Se han previsto y gestionado las excepciones.",
                    "g) Se han probado y documentado las aplicaciones desarrolladas."
                ]
            },
            {
                "id": "2",
                "description": "Desarrolla aplicaciones que gestionan información almacenada en bases de datos relacionales identificando y utilizando mecanismos de conexión.",
                "evaluation_criteria": [
                    "a) Se han valorado las ventajas e inconvenientes de utilizar conectores.",
                    "b) Se han utilizado gestores de bases de datos embebidos e independientes.",
                    "c) Se ha utilizado el conector idóneo en la aplicación.",
                    "d) Se ha establecido la conexión.",
                    "e) Se ha definido la estructura de la base de datos.",
                    "f) Se han desarrollado aplicaciones que modifican el contenido de la base de datos.",
                    "g) Se han definido los objetos destinados a almacenar el resultado de las consultas.",
                    "h) Se han desarrollado aplicaciones que efectúan consultas.",
                    "i) Se han eliminado los objetos una vez finalizada su función.",
                    "j) Se han gestionado las transacciones.",
                    "k) Se han ejecutado procedimientos almacenados en la base de datos."
                ]
            },
            {
                "id": "3",
                "description": "Gestiona la persistencia de los datos identificando herramientas de mapeo objeto relacional (ORM) y desarrollando aplicaciones que las utilizan.",
                "evaluation_criteria": [
                    "a) Se ha instalado la herramienta ORM.",
                    "b) Se ha configurado la herramienta ORM.",
                    "c) Se han definido configuraciones de mapeo.",
                    "d) Se han aplicado mecanismos de persistencia a los objetos.",
                    "e) Se han desarrollado aplicaciones que modifican y recuperan objetos persistentes.",
                    "f) Se han desarrollado aplicaciones que realizan consultas usando el lenguaje SQL.",
                    "g) Se han gestionado las transacciones."
                ]
            },
            {
                "id": "4",
                "description": "Desarrolla aplicaciones que gestionan la información almacenada en bases de datos objeto relacionales y orientadas a objetos valorando sus características y utilizando los mecanismos de acceso incorporados.",
                "evaluation_criteria": [
                    "a) Se han identificado las ventajas e inconvenientes de las bases de datos que almacenan objetos.",
                    "b) Se han establecido y cerrado conexiones.",
                    "c) Se ha gestionado la persistencia de objetos simples.",
                    "d) Se ha gestionado la persistencia de objetos estructurados.",
                    "e) Se han desarrollado aplicaciones que realizan consultas.",
                    "f) Se han modificado los objetos almacenados.",
                    "g) Se han gestionado las transacciones.",
                    "h) Se han probado y documentado las aplicaciones desarrolladas."
                ]
            },
            {
                "id": "5",
                "description": "Desarrolla aplicaciones que gestionan la información almacenada en bases de datos documentales nativas evaluando y utilizando clases específicas.",
                "evaluation_criteria": [
                    "a) Se han valorado las ventajas e inconvenientes de utilizar bases de datos documentales nativas.",
                    "b) Se ha establecido la conexión con la base de datos.",
                    "c) Se han desarrollado aplicaciones que efectúan consultas sobre el contenido de la base de datos.",
                    "d) Se han añadido y eliminado colecciones de la base de datos.",
                    "e) Se han desarrollado aplicaciones para añadir, modificar y eliminar documentos de la base de datos."
                ]
            },
            {
                "id": "6",
                "description": "Programa componentes de acceso a datos identificando las características que debe poseer un componente y utilizando herramientas de desarrollo.",
                "evaluation_criteria": [
                    "a) Se han valorado las ventajas e inconvenientes de utilizar programación orientada a componentes.",
                    "b) Se han identificado herramientas de desarrollo de componentes.",
                    "c) Se han programado componentes que gestionan información almacenada en ficheros.",
                    "d) Se han programado componentes que gestionan mediante conectores información almacenada en bases de datos.",
                    "e) Se han programado componentes que gestionan información usando mapeo objeto relacional.",
                    "f) Se han programado componentes que gestionan información almacenada en bases de datos objeto relacionales y orientadas a objetos.",
                    "g) Se han programado componentes que gestionan información almacenada en una base de datos documental nativa.",
                    "h) Se han probado y documentado los componentes desarrollados.",
                    "i) Se han integrado los componentes desarrollados en aplicaciones."
                ]
            }
        ],
        "contents": [
            "Manejo de ficheros:",
            "−\tClases asociadas a las operaciones de gestión de ficheros y directorios: creación, borrado, copia, movimiento, recorrido, entre otras.",
            "−\tFormas de acceso a un fichero. Ventajas.",
            "−\tClases para gestión de flujos de datos desde/hacia ficheros. Flujos de bytes y de caracteres.",
            "−\tOperaciones sobre ficheros secuenciales y aleatorios.",
            "−\tSerialización/deserialización de objetos.",
            "−\tTrabajo con ficheros: de intercambio de datos (XML y JSON, entre otros). Analizadores sintácticos (parser) y vinculación (binding). Conversión entre diferentes formatos.",
            "−\tExcepciones: detección y tratamiento.",
            "−\tDesarrollo de aplicaciones que utilizan ficheros.",
            "Manejo de conectores:",
            "−\tEl desfase objeto-relacional.",
            "−\tProtocolos de acceso a bases de datos. Conectores.",
            "−\tEstablecimiento de conexiones. Pooling de conexiones.",
            "−\tEjecución de sentencias de descripción de datos.",
            "−\tEjecución de sentencias de modificación de datos.",
            "−\tEjecución de consultas. Manipulación del resultado.",
            "−\tEjecución de procedimientos almacenados en la base de datos. Parámetros.",
            "−\tGestión de transacciones.",
            "−\tDesarrollo de programas que utilizan bases de datos.",
            "Herramientas de mapeo objeto relacional (ORM):",
            "−\tConcepto de mapeo objeto relacional.",
            "−\tCaracterísticas de las herramientas ORM. Herramientas ORM más utilizadas.",
            "−\tInstalación de una herramienta ORM. Configuración.",
            "−\tEstructura de un fichero de mapeo. Elementos, propiedades.",
            "−\tMapeo basado en anotaciones.",
            "−\tClases persistentes.",
            "−\tSesiones; estados de un objeto.",
            "−\tCarga, almacenamiento y modificación de objetos.",
            "−\tConsultas SQL.",
            "−\tGestión de transacciones.",
            "−\tDesarrollo de programas que utilizan bases de datos a través de herramientas ORM.",
            "Bases de datos objeto relacionales y orientadas a objetos:",
            "−\tGestores de bases de datos objeto relacionales. Características. Ventajas.",
            "−\tGestión de objetos con SQL; ANSI SQL.",
            "−\tAcceso a las funciones del gestor de base de datos objeto-relacional desde el lenguaje de programación.",
            "−\tGestores de bases de datos orientadas a objetos. Características. Ventajas.",
            "−\tGestión de la persistencia de objetos.",
            "−\tEl interfaz de programación de aplicaciones de la base de datos orientada a objetos. Consultas y persistencia de datos. Lenguaje OQL.",
            "−\tGestión de transacciones.",
            "−\tDesarrollo de programas que gestionan objetos en bases de datos.",
            "Bases de datos documentales:",
            "−\tBases de datos documentales nativas. Características. Ventajas.",
            "−\tEstablecimiento y cierre de conexiones.",
            "−\tColecciones y documentos.",
            "−\tCreación y borrado de colecciones; clases y métodos.",
            "−\tAñadir, modificar y eliminar documentos; clases y métodos.",
            "−\tLenguajes de consulta. Realización de consultas; clases y métodos.",
            "−\tDesarrollo de programas que utilizan bases de datos documentales.",
            "Programación de componentes de acceso a datos:",
            "−\tConcepto de componente; características. Ventajas.",
            "−\tPropiedades y atributos.",
            "−\tEventos; asociación de acciones a eventos.",
            "−\tPersistencia del componente. Serialización.",
            "−\tHerramientas para desarrollo de componentes.",
            "−\tDesarrollo, empaquetado y utilización de componentes."
        ]
    },
    "0488": {
        "name": "Desarrollo de interfaces",
        "code": "0488",
        "hours": "80",
        "ects": "9",
        "learning_results": [
            {
                "id": "1",
                "description": "Genera interfaces gráficos de usuario mediante editores visuales utilizando las funcionalidades del editor y adaptando el código generado.",
                "evaluation_criteria": [
                    "a) Se han analizado las herramientas y librerías disponibles para la generación de interfaces gráficos.",
                    "b) Se ha creado un interfaz gráfico utilizando las herramientas de un editor visual.",
                    "c) Se han utilizado las funciones del editor para ubicar los componentes del interfaz.",
                    "d) Se han modificado las propiedades de los componentes para adecuarlas a las necesidades de la aplicación.",
                    "e) Se ha analizado el código generado por el editor visual.",
                    "f) Se ha modificado el código generado por el editor visual.",
                    "g) Se han asociado a los eventos las acciones correspondientes.",
                    "h) Se ha desarrollado una aplicación que incluye el interfaz gráfico obtenido."
                ]
            },
            {
                "id": "2",
                "description": "Genera interfaces naturales de usuario utilizando herramientas visuales.",
                "evaluation_criteria": [
                    "a) Se han identificado las herramientas disponibles para el aprendizaje automático relacionadas con las interfaces de usuario.",
                    "b) Se ha creado una interfaz natural de usuario utilizando las herramientas disponibles.",
                    "c) Se ha utilizado el reconocimiento de voz para implementar acciones en las interfaces naturales de usuario.",
                    "d) Se ha incorporado la detección del movimiento del cuerpo para implementar acciones en las interfaces naturales de usuario.",
                    "e) Se han integrado elementos de detección de partes del cuerpo para implementar acciones en las interfaces naturales de usuario.",
                    "f) Se ha integrado la realidad aumentada en los interfaces de usuario."
                ]
            },
            {
                "id": "3",
                "description": "Crea componentes visuales valorando y empleando herramientas específicas.",
                "evaluation_criteria": [
                    "a) Se han identificado las herramientas para diseño y prueba de componentes.",
                    "b) Se han creado componentes visuales.",
                    "c) Se han definido sus métodos y propiedades con asignación de valores por defecto.",
                    "d) Se han determinado los eventos a los que debe responder el componente y se les han asociado las acciones correspondientes.",
                    "e) Se han realizado pruebas unitarias sobre los componentes desarrollados.",
                    "f) Se han documentado los componentes creados.",
                    "g) Se han empaquetado componentes.",
                    "h) Se han programado aplicaciones cuyo interfaz gráfico utiliza los componentes creados."
                ]
            },
            {
                "id": "4",
                "description": "Diseña interfaces gráficas identificando y aplicando criterios de usabilidad y accesibilidad.",
                "evaluation_criteria": [
                    "a) Se han identificado los principales estándares de usabilidad y accesibilidad.",
                    "b) Se ha valorado la importancia del uso de estándares para la creación de interfaces.",
                    "c) Se han creado diferentes tipos de menús cuya estructura y contenido siguen los estándares establecidos.",
                    "d) Se han distribuido las acciones en menús, barras de herramientas, botones de comando, entre otros, siguiendo un criterio coherente.",
                    "e) Se han distribuido adecuadamente los controles en la interfaz de usuario.",
                    "f) Se ha utilizado el tipo de control más apropiado en cada caso.",
                    "g) Se ha diseñado el aspecto de la interfaz de usuario (colores y fuentes entre otros) atendiendo a su legibilidad.",
                    "h) Se ha verificado que los mensajes generados por la aplicación son adecuados en extensión y claridad.",
                    "i) Se han realizado pruebas para evaluar la usabilidad y accesibilidad de la aplicación."
                ]
            },
            {
                "id": "5",
                "description": "Crea informes evaluando y utilizando herramientas gráficas.",
                "evaluation_criteria": [
                    "a) Se ha establecido la estructura del informe.",
                    "b) Se han generado informes básicos a partir de diferentes fuentes de datos mediante asistentes.",
                    "c) Se han establecido filtros sobre los valores a presentar en los informes.",
                    "d) Se han incluido valores calculados, recuentos y totales.",
                    "e) Se han incluido gráficos generados a partir de los datos.",
                    "f) Se han utilizado herramientas para generar el código correspondiente a los informes de una aplicación.",
                    "g) Se ha modificado el código correspondiente a los informes.",
                    "h) Se ha desarrollado una aplicación que incluye informes incrustados."
                ]
            },
            {
                "id": "6",
                "description": "Documenta aplicaciones seleccionando y utilizando herramientas específicas.",
                "evaluation_criteria": [
                    "a) Se han identificado sistemas de generación de ayudas.",
                    "b) Se han generado ayudas en los formatos habituales.",
                    "c) Se han generado ayudas sensibles al contexto.",
                    "d) Se ha documentado la estructura de la información persistente.",
                    "e) Se ha confeccionado el manual de usuario y la guía de referencia.",
                    "f) Se han confeccionado los manuales de instalación, configuración y administración.",
                    "g) Se han confeccionado tutoriales."
                ]
            },
            {
                "id": "7",
                "description": "Prepara aplicaciones para su distribución evaluando y utilizando herramientas específicas.",
                "evaluation_criteria": [
                    "a) Se han empaquetado los componentes que requiere la aplicación.",
                    "b) Se ha personalizado el asistente de instalación.",
                    "c) Se han generado paquetes de instalación utilizando el entorno de desarrollo.",
                    "d) Se han generado paquetes de instalación utilizando herramientas externas.",
                    "e) Se han firmado digitalmente las aplicaciones para su distribución.",
                    "f) Se han generado paquetes instalables en modo desatendido.",
                    "g) Se ha preparado el paquete de instalación para que la aplicación pueda ser correctamente desinstalada.",
                    "h) Se ha preparado la aplicación para ser distribuida a través de diferentes canales de distribución."
                ]
            },
            {
                "id": "8",
                "description": "Evalúa el funcionamiento de aplicaciones diseñando y ejecutando pruebas.",
                "evaluation_criteria": [
                    "a) Se ha establecido una estrategia de pruebas.",
                    "b) Se han realizado pruebas de integración de los distintos elementos.",
                    "c) Se han realizado pruebas de regresión.",
                    "d) Se han realizado pruebas de volumen y estrés.",
                    "e) Se han realizado pruebas de seguridad.",
                    "f) Se han realizado pruebas de uso de recursos por parte de la aplicación.",
                    "g) Se ha documentado la estrategia de pruebas y los resultados obtenidos."
                ]
            }
        ],
        "contents": [
            "Generación de interfaces de usuario:",
            "−\tPatrones de arquitectura de las aplicaciones gráficas.",
            "−\tLibrerías de componentes nativas y multiplataforma. Características.",
            "−\tHerramientas propietarias y libres de edición de interfaces.",
            "−\tLenguajes descriptivos para la definición de interfaces.",
            "−\tComponentes: características y campo de aplicación.",
            "−\tEnlace de componentes a orígenes de datos.",
            "−\tAsociación de acciones a eventos.",
            "−\tEdición del código generado por la herramienta de diseño.",
            "−\tClases, propiedades, métodos.",
            "−\tEventos; escuchadores.",
            "Generación de interfaces naturales de usuario:",
            "−\tHerramientas para el aprendizaje automático. Entrenamiento.",
            "−\tInterfaces naturales. Tipos.",
            "−\tVoz y Habla. Reconocimiento.",
            "−\tPartes y movimientos del cuerpo. Detección.",
            "−\tRealidad aumentada.",
            "Creación de componentes visuales:",
            "−\tConcepto de componente; características.",
            "−\tPropiedades, atributos y métodos.",
            "−\tEventos; asociación de acciones a eventos.",
            "−\tPersistencia del componente.",
            "−\tHerramientas para desarrollo de componentes visuales.",
            "−\tPrueba de los componentes.",
            "−\tEmpaquetado de componentes.",
            "Diseño de interfaces gráficas:",
            "−\tUsabilidad y accesibilidad. Características. Pautas. Estándares.",
            "−\tMedidas de usabilidad y accesibilidad de las aplicaciones; herramientas.",
            "−\tEsquemas (Wireframes) y Maquetas (Mockups).",
            "−\tPautas de diseño de la estructura de la interfaz de usuario; menús, ventanas, cuadros de diálogo, atajos de teclado, entre otros.",
            "−\tPautas de diseño del aspecto de la interfaz de usuario: colores, fuentes, iconos, distribución de los elementos.",
            "−\tPautas de diseño de los elementos interactivos de la interfaz de usuario: Botones de comando, listas desplegables, entre otros.",
            "−\tPautas de diseño de la secuencia de control de la aplicación.",
            "Creación de informes:",
            "−\tInformes incrustados y no incrustados en la aplicación.",
            "−\tHerramientas gráficas integradas en el IDE y externas al mismo.",
            "−\tEstructura general. Secciones.",
            "−\tFiltrado de datos.",
            "−\tNumeración de líneas, recuentos y totales.",
            "−\tGráficos.",
            "−\tLibrerías para generación de informes. Clases, métodos y atributos.",
            "−\tConexión con las fuentes de datos. Ejecución de consultas.",
            "Documentación de aplicaciones:",
            "−\tFicheros de ayuda. Formatos.",
            "−\tHerramientas de generación de ayudas.",
            "−\tTablas de contenidos, índices, sistemas de búsqueda, entre otros.",
            "−\tTipos de manuales: Manual de usuario, guía de referencia, guías rápidas, manuales de instalación, configuración y administración. Preguntas más frecuentes. Destinatarios y estructura.",
            "−\tElaboración de tutoriales.",
            "Distribución de aplicaciones:",
            "−\tComponentes de una aplicación. Empaquetado.",
            "−\tInstaladores.",
            "−\tPaquetes autoinstalables.",
            "−\tFirma digital de aplicaciones.",
            "−\tHerramientas para crear paquetes de instalación.",
            "−\tPersonalización de la instalación: Logotipos, fondos, diálogos, botones, idioma, entre otros.",
            "−\tAsistentes de instalación y desinstalación.",
            "−\tCanales de distribución: repositorios (stores), ad-hoc, sitios web, correo electrónico, entre otros.",
            "Realización de pruebas:",
            "−\tObjetivo, importancia y limitaciones del proceso de prueba. Estrategias.",
            "−\tPruebas de integración: ascendentes y descendentes.",
            "−\tPruebas de sistema: configuración, recuperación, entre otras.",
            "−\tPruebas de uso de recursos.",
            "−\tPruebas de seguridad.",
            "−\tPruebas manuales y automáticas. Herramientas software para la realización de pruebas."
        ]
    },
    "0489": {
        "name": "Programación multimedia y dispositivos móviles",
        "code": "0489",
        "hours": "55",
        "ects": "7",
        "learning_results": [
            {
                "id": "1",
                "description": "Aplica tecnologías de desarrollo para dispositivos móviles evaluando sus características y capacidades.",
                "evaluation_criteria": [
                    "a) Se han analizado las limitaciones que plantea la ejecución de aplicaciones en los dispositivos móviles.",
                    "b) Se han identificado las tecnologías de desarrollo de aplicaciones para dispositivos móviles.",
                    "c) Se han instalado, configurado y utilizado entornos de trabajo para el desarrollo de aplicaciones para dispositivos móviles.",
                    "d) Se han identificado configuraciones que clasifican los dispositivos móviles en base a sus características.",
                    "e) Se han descrito perfiles que establecen la relación entre el dispositivo y la aplicación.",
                    "f) Se ha analizado la estructura de aplicaciones existentes para dispositivos móviles identificando las clases utilizadas.",
                    "g) Se han realizado modificaciones sobre aplicaciones existentes.",
                    "h) Se han utilizado emuladores para comprobar el funcionamiento de las aplicaciones."
                ]
            },
            {
                "id": "2",
                "description": "Desarrolla aplicaciones para dispositivos móviles analizando y empleando las tecnologías y librerías específicas.",
                "evaluation_criteria": [
                    "a) Se ha generado la estructura de clases necesaria para la aplicación.",
                    "b) Se han analizado y utilizado las clases que modelan ventanas, menús, alertas y controles para el desarrollo de aplicaciones gráficas sencillas.",
                    "c) Se han utilizado las clases necesarias para la conexión y comunicación con dispositivos inalámbricos.",
                    "d) Se han desarrollado aplicaciones que hacen uso de las funcionalidades proporcionadas por los sensores.",
                    "e) Se han utilizado las clases necesarias para establecer conexiones y comunicaciones HTTP y HTTPS.",
                    "f) Se han utilizado las clases necesarias para establecer conexiones con almacenes de datos garantizando la persistencia.",
                    "g) Se han realizado pruebas de interacción usuario-aplicación para optimizar las aplicaciones desarrolladas a partir de emuladores.",
                    "h) Se han empaquetado y desplegado las aplicaciones desarrolladas en dispositivos móviles reales.",
                    "i) Se han documentado los procesos necesarios para el desarrollo de las aplicaciones.",
                    "j) Se han establecido los permisos requeridos para el funcionamiento de las aplicaciones."
                ]
            },
            {
                "id": "3",
                "description": "Desarrolla programas que integran contenidos multimedia analizando y empleando las tecnologías y librerías específicas.",
                "evaluation_criteria": [
                    "a) Se han analizado entornos de desarrollo multimedia.",
                    "b) Se han reconocido las clases que permiten la captura, procesamiento y almacenamiento de datos multimedia.",
                    "c) Se han utilizado clases para la conversión de datos multimedia de un formato a otro.",
                    "d) Se han utilizado clases para procesar datos multimedia.",
                    "e) Se han utilizado clases para el control de eventos, tipos de media y excepciones, entre otros.",
                    "f) Se han utilizado clases para la creación y control de animaciones.",
                    "g) Se han utilizado clases para reproducir contenidos multimedia.",
                    "h) Se han depurado y documentado los programas desarrollados."
                ]
            },
            {
                "id": "4",
                "description": "Selecciona y prueba motores de juegos analizando la arquitectura de juegos 2D y 3D.",
                "evaluation_criteria": [
                    "a) Se han identificado los elementos que componen la arquitectura de un juego 2D y 3D.",
                    "b) Se han analizado los componentes de un motor de juegos.",
                    "c) Se han analizado entornos de desarrollo de juegos.",
                    "d) Se han analizado diferentes motores de juegos, sus características y funcionalidades.",
                    "e) Se han identificado los bloques funcionales de un juego existente.",
                    "f) Se ha reconocido la representación lógica y espacial de una escena gráfica sobre un juego existente."
                ]
            },
            {
                "id": "5",
                "description": "Desarrolla juegos 2D y 3D sencillos utilizando motores de juegos.",
                "evaluation_criteria": [
                    "a) Se ha establecido la lógica de un nuevo juego.",
                    "b) Se han creado los objetos necesarios para el juego y definido sus características.",
                    "c) Se han creado las escenas del juego y distribuido los objetos en las mismas.",
                    "d) Se han creado materiales para determinar las propiedades finales de la superficie de un objeto.",
                    "e) Se han establecido las propiedades físicas de los objetos.",
                    "f) Se ha incorporado sonido a los diferentes eventos del juego.",
                    "g) Se han utilizado cámaras y configurado la iluminación.",
                    "h) Se han desarrollado e implantado juegos para dispositivos móviles.",
                    "i) Se han realizado pruebas de funcionamiento y optimización de los juegos desarrollados.",
                    "j) Se han documentado las fases de diseño y desarrollo de los juegos creados."
                ]
            }
        ],
        "contents": [
            "Análisis de tecnologías para aplicaciones en dispositivos móviles:",
            "−\tDispositivos móviles. Evolución. Tipos. Características.",
            "−\tHardware para dispositivos móviles: pantalla, procesador, memoria, cámara, batería, sensores, conectividad, entre otros. Limitaciones.",
            "−\tTecnologías de desarrollo. Nativas y multiplataforma. Entornos de trabajo. Módulos y librerías. Lenguajes.",
            "−\tEmuladores. Configuraciones. Perfiles. Dispositivos soportados.",
            "−\tAplicaciones móviles. Estructura. Jerarquía de clases.",
            "−\tModelo de estados de una aplicación móvil: activo, pausa y destruido.",
            "−\tCiclo de vida de una aplicación: descubrimiento, instalación, ejecución, actualización y borrado.",
            "−\tModificación de aplicaciones existentes.",
            "−\tUtilización del entorno de ejecución del administrador de aplicaciones.",
            "Desarrollo de aplicaciones para dispositivos móviles:",
            "−\tHerramientas. Flujo de trabajo.",
            "−\tComponentes de una aplicación. Recursos.",
            "−\tInterfaces de usuario. Clases asociadas.",
            "−\tContexto gráfico. Imágenes.",
            "−\tMétodos de entrada. Eventos.",
            "−\tGestión de las preferencias de la aplicación.",
            "−\tBases de datos y almacenamiento.",
            "−\tPersistencia.",
            "−\tTareas en segundo plano. Servicios.",
            "−\tSeguridad y permisos.",
            "−\tConectividad. Tipos. Clases asociadas. Gestión de las comunicaciones.",
            "−\tManejo de conexiones HTTP y HTTPS. Acceso a servicios web.",
            "−\tSensores.",
            "−\tPosicionamiento. Localización. Mapas.",
            "Utilización de librerías multimedia integradas:",
            "−\tConceptos sobre aplicaciones multimedia.",
            "−\tArquitectura del API utilizado.",
            "−\tFuentes de datos multimedia. Clases.",
            "−\tProcesamiento de objetos multimedia. Clases. Estados, métodos y eventos.",
            "−\tReproducción de objetos multimedia. Clases. Estados, métodos y eventos.",
            "−\tAnimación de objetos.",
            "Análisis de motores de juegos:",
            "−\tAnimación 2D y 3D.",
            "−\tArquitectura del juego. Componentes.",
            "−\tMotores de juegos: Tipos y utilización.",
            "−\tÁreas de especialización, librerías utilizadas y lenguajes de programación.",
            "−\tComponentes de un motor de juegos.",
            "−\tLibrerías que proporcionan las funciones básicas de un Motor 2D/3D. Clases.",
            "−\tEstudio de juegos existentes.",
            "−\tAplicación de modificaciones sobre juegos existentes.",
            "Desarrollo de juegos 2D y 3D:",
            "−\tTécnicas de programación 2D/3D.",
            "−\tFases de desarrollo.",
            "−\tComponentes de los objetos: materiales y texturas. Propiedades físicas (peso, gravedad, fricciones, colisiones, entre otros).",
            "−\tFuentes de audio. Propiedades.",
            "−\tCámaras e iluminación.",
            "−\tCreación de escenas. Jerarquía de objetos.",
            "−\tAnálisis de ejecución. Optimización del código."
        ]
    },
    "0490": {
        "name": "Programación de Servicios y Procesos",
        "code": "0490",
        "hours": "40",
        "ects": "5",
        "learning_results": [
            {
                "id": "1",
                "description": "Desarrolla aplicaciones compuestas por varios procesos reconociendo y aplicando principios de programación paralela.",
                "evaluation_criteria": [
                    "a) Se han reconocido las características de la programación concurrente y sus ámbitos de aplicación.",
                    "b) Se han identificado las diferencias entre programación paralela y programación distribuida, sus ventajas e inconvenientes.",
                    "c) Se han analizado las características de los procesos y de su ejecución por el sistema operativo.",
                    "d) Se han caracterizado los hilos de ejecución y descrito su relación con los procesos.",
                    "e) Se han utilizado clases para programar aplicaciones que crean subprocesos.",
                    "f) Se han utilizado mecanismos para compartir información con los subprocesos iniciados.",
                    "g) Se han utilizado mecanismos para sincronizar y obtener el valor devuelto por los subprocesos iniciados.",
                    "h) Se han desarrollado aplicaciones que gestionen y utilicen procesos para la ejecución de varias tareas en paralelo.",
                    "i) Se han depurado y documentado las aplicaciones desarrolladas."
                ]
            },
            {
                "id": "2",
                "description": "Desarrolla aplicaciones compuestas por varios hilos de ejecución analizando y aplicando librerías específicas del lenguaje de programación.",
                "evaluation_criteria": [
                    "a) Se han identificado situaciones en las que resulte útil la utilización de varios hilos en un programa.",
                    "b) Se han reconocido los mecanismos para crear, iniciar y finalizar hilos.",
                    "c) Se han programado aplicaciones que implementen varios hilos.",
                    "d) Se han identificado los posibles estados de ejecución de un hilo y programado aplicaciones que los gestionen.",
                    "e) Se han utilizado mecanismos para compartir información entre varios hilos de un mismo proceso.",
                    "f) Se han desarrollado programas formados por varios hilos sincronizados mediante técnicas específicas.",
                    "g) Se ha establecido y controlado la prioridad de cada uno de los hilos de ejecución.",
                    "h) Se han depurado y documentado los programas desarrollados.",
                    "i) Se ha analizado el contexto de ejecución de los hilos.",
                    "j) Se han analizado librerías específicas del lenguaje de programación que permiten la programacióm multihilo.",
                    "k) Se han reconocido los problemas derivados de la compartición de información entre los hilos de un mismo proceso."
                ]
            },
            {
                "id": "3",
                "description": "Programa mecanismos de comunicación en red empleando sockets y analizando el escenario de ejecución.",
                "evaluation_criteria": [
                    "a) Se han identificado escenarios que precisan establecer comunicación en red entre varias aplicaciones.",
                    "b) Se han identificado los roles de cliente y de servidor y sus funciones asociadas.",
                    "c) Se han reconocido librerías y mecanismos del lenguaje de programación que permiten programar aplicaciones en red.",
                    "d) Se ha analizado el concepto de socket, sus tipos y características.",
                    "e) Se han utilizado sockets para programar una aplicación cliente que se comunique con un servidor.",
                    "f) Se ha desarrollado una aplicación servidor en red y verificado su funcionamiento.",
                    "g) Se han desarrollado aplicaciones que utilizan sockets para intercambiar",
                    "h) información.",
                    "i) Se han utilizado hilos para posibilitar la comunicación simultánea de varios clientes con el servidor.",
                    "j) Se han caracterizado los modelos de comunicación más usuales en las arquitecturas de aplicaciones distribuidas.",
                    "k) Se han depurado y documentado las aplicaciones desarrolladas."
                ]
            },
            {
                "id": "4",
                "description": "Desarrolla aplicaciones que ofrecen servicios en red, utilizando librerías de clases y aplicando criterios de eficiencia y disponibilidad.",
                "evaluation_criteria": [
                    "a) Se han identificado diferentes protocolos estándar de comunicación para la implementación de servicios en red.",
                    "b) Se han reconocido las ventajas de la utilización de protocolos estándar para la comunicación entre aplicaciones y procesos.",
                    "c) Se han analizado librerías que permitan implementar servicios en red utilizando protocolos estándar de comunicación.",
                    "d) Se han desarrollado y probado servicios de comunicación en red.",
                    "e) Se han utilizado clientes de comunicaciones para verificar el funcionamiento de los servicios.",
                    "f) Se han incorporado mecanismos para posibilitar la comunicación simultánea de varios clientes con el servicio.",
                    "g) Se ha verificado la disponibilidad del servicio.",
                    "h) Se han depurado y documentado las aplicaciones desarrolladas."
                ]
            },
            {
                "id": "5",
                "description": "Protege las aplicaciones y los datos definiendo y aplicando criterios de seguridad en el acceso, almacenamiento y transmisión de la información.",
                "evaluation_criteria": [
                    "a) Se han identificado y aplicado principios y prácticas de programación segura.",
                    "b) Se han analizado las principales técnicas y prácticas criptográficas.",
                    "c) Se han definido e implantado políticas de seguridad para limitar y controlar el acceso de los usuarios a las aplicaciones desarrolladas.",
                    "d) Se han utilizado esquemas de seguridad basados en roles.",
                    "e) Se han empleado algoritmos criptográficos para proteger el acceso a la información almacenada.",
                    "f) Se han identificado métodos para asegurar la información transmitida.",
                    "g) Se han desarrollado aplicaciones que utilicen comunicaciones seguras para la transmisión de información.",
                    "h) Se han depurado y documentado las aplicaciones desarrolladas."
                ]
            }
        ],
        "contents": [
            "Programación multiproceso:",
            "−\tEjecutables. Procesos. Servicios.",
            "−\tEstados de un proceso. Planificación de procesos.",
            "−\tHilos.",
            "−\tProgramación concurrente.",
            "−\tProgramación paralela y distribuida.",
            "−\tComunicación entre procesos.",
            "−\tGestión de procesos. Herramientas de monitorización.",
            "−\tSincronización entre procesos.",
            "−\tProgramación de aplicaciones multiproceso.",
            "Programación multihilo:",
            "−\tContexto de ejecución de los hilos. Recursos compartidos.",
            "−\tEstados de un hilo. Cambios de estado.",
            "−\tLibrerías y clases.",
            "−\tGestión de hilos. Prioridades.",
            "−\tSincronización de hilos.",
            "−\tCompartición de información entre hilos. Problemas.",
            "−\tProgramación de aplicaciones multihilo.",
            "Programación de comunicaciones en red:",
            "−\tComunicación entre aplicaciones. Modelos.",
            "−\tRoles cliente y servidor.",
            "−\tLibrerías y clases.",
            "−\tSockets. Tipos. Características.",
            "−\tCreación de sockets.",
            "−\tEnlazado y establecimiento de conexiones.",
            "−\tUtilización de sockets para la transmisión y recepción de información.",
            "−\tProgramación de aplicaciones cliente y servidor.",
            "−\tUtilización de hilos para la implementación de comunicaciones simultáneas con el servidor.",
            "Generación de servicios en red:",
            "−\tProtocolos estándar de comunicación en red a nivel de aplicación. Ventajas de su utilización.",
            "−\tServicios web.",
            "−\tLibrerías de clases y componentes.",
            "−\tProgramación de servidores.",
            "−\tEstablecimiento y finalización de conexiones.",
            "−\tTransmisión de información.",
            "−\tImplementación de comunicaciones simultáneas.",
            "−\tUtilización de aplicaciones clientes.",
            "−\tMonitorización del servicio. Herramientas.",
            "Utilización de técnicas de programación segura:",
            "−\tPrácticas de programación segura.",
            "−\tCriptografía de clave pública y clave privada.",
            "−\tPrincipales aplicaciones de la criptografía.",
            "−\tProtocolos criptográficos.",
            "−\tPolítica de seguridad. Roles.",
            "−\tProgramación de mecanismos de control de acceso.",
            "−\tEncriptación de información.",
            "−\tProtocolos seguros de comunicaciones.",
            "−\tProgramación de aplicaciones con comunicaciones seguras."
        ]
    },
    "0491": {
        "name": "Sistemas de Gestión Empresarial",
        "code": "0491",
        "hours": "55",
        "ects": "6 ",
        "learning_results": [
            {
                "id": "1",
                "description": "Identifica sistemas de planificación de recursos empresariales y de gestión de relaciones con clientes (ERP-CRM) reconociendo sus características y verificando la configuración del sistema informático.",
                "evaluation_criteria": [
                    "a) Se han reconocido los diferentes sistemas ERP-CRM que existen en el mercado.",
                    "b) Se han identificado los diferentes tipos de licencia de los sistemas ERP-CRM.",
                    "c) Se han comparado sistemas ERP-CRM en función de sus características y requisitos.",
                    "d) Se ha identificado el sistema operativo adecuado a cada sistema ERP-CRM.",
                    "e) Se ha identificado el sistema gestor de datos adecuado a cada sistema ERP-CRM.",
                    "f) Se han verificado las configuraciones del sistema operativo y del gestor de datos para garantizar la funcionalidad del ERP-CRM.",
                    "g) Se han documentado las operaciones realizadas.",
                    "h) Se han documentado las incidencias producidas durante el proceso."
                ]
            },
            {
                "id": "2",
                "description": "Implanta sistemas ERP-CRM interpretando la documentación técnica e identificando las diferentes opciones y módulos.",
                "evaluation_criteria": [
                    "a) Se han identificado los módulos que componen el ERP-CRM.",
                    "b) Se han realizado diferentes tipos de instalaciones.",
                    "c) Se han configurado los módulos instalados.",
                    "d) Se han realizado instalaciones adaptadas a las necesidades planteadas en diferentes supuestos.",
                    "e) Se ha verificado el funcionamiento del ERP-CRM.",
                    "f) Se han documentado las operaciones realizadas y las incidencias."
                ]
            },
            {
                "id": "3",
                "description": "Realiza operaciones de gestión, consulta y análisis de la información siguiendo las especificaciones de diseño y utilizando las herramientas proporcionadas por los sistemas ERP-CRM.",
                "evaluation_criteria": [
                    "a) Se han utilizado herramientas y lenguajes de consulta y manipulación de datos proporcionados por los sistemas ERP-CRM.",
                    "b) Se han generado formularios.",
                    "c) Se han generado informes.",
                    "d) Se han exportado datos e informes.",
                    "e) Se han automatizado las extracciones de datos mediante procesos.",
                    "f) Se ha verificado el rendimiento del sistema ERP-CRM.",
                    "g) Se han documentado las operaciones realizadas y las incidencias observadas.",
                    "h) Se ha obtenido información relevante a partir de los datos procesados."
                ]
            },
            {
                "id": "4",
                "description": "Adapta sistemas ERP-CRM identificando los requerimientos de un supuesto empresarial y utilizando las herramientas proporcionadas por los mismos.",
                "evaluation_criteria": [
                    "a) Se han identificado las posibilidades de adaptación del ERP-CRM.",
                    "b) Se han adaptado definiciones de campos, tablas y vistas de la base de datos del ERP-CRM.",
                    "c) Se han adaptado consultas.",
                    "d) Se han adaptado interfaces de entrada de datos y de procesos.",
                    "e) Se han personalizado informes.",
                    "f) Se han creado paneles de control.",
                    "g) Se han adaptado procedimientos almacenados de servidor.",
                    "h) Se han realizado pruebas.",
                    "i) Se han documentado las operaciones realizadas y las incidencias observadas.",
                    "j) Se han realizado integraciones con otro sistema de gestión empresarial."
                ]
            },
            {
                "id": "5",
                "description": "Desarrolla componentes para un sistema ERP-CRM analizando y utilizando el lenguaje de programación incorporado.",
                "evaluation_criteria": [
                    "a) Se han reconocido las sentencias del lenguaje propio del sistema ERP-CRM.",
                    "b) Se han utilizado los elementos de programación del lenguaje para crear componentes de manipulación de datos y extracción de información.",
                    "c) Se han modificado componentes software para añadir nuevas funcionalidades al sistema.",
                    "d) Se han integrado los nuevos componentes software en el sistema ERP-CRM.",
                    "e) Se ha verificado el correcto funcionamiento de los componentes creados.",
                    "f) Se han documentado todos los componentes creados o modificados.",
                    "g) Se ha analizado la arquitectura del ERP-CRM."
                ]
            }
        ],
        "contents": [
            "Identificación de sistemas ERP-CRM:",
            "−\tConcepto de ERP (Sistemas de planificación de recursos empresariales).",
            "−\tRevisión de los ERP actuales.",
            "−\tConcepto de CRM (Sistemas de gestión de relaciones con clientes).",
            "−\tRevisión de los CRM actuales.",
            "−\tTipos de licencias de los ERP-CRM.",
            "−\tSistemas gestores de bases de datos compatibles con el software.",
            "−\tInstalación y configuración del sistema informático.",
            "−\tVerificación de la instalación y configuración de los sistemas operativos y de gestión de datos.",
            "−\tDocumentación de las operaciones realizadas.",
            "Instalación y configuración de sistemas ERP-CRM:",
            "−\tTipos de instalación. Monopuesto. Cliente/servidor. En la nube.",
            "−\tMódulos de un sistema ERP-CRM: descripción, tipología e interconexión entre módulos.",
            "−\tProcesos de instalación del sistema ERP-CRM.",
            "−\tParámetros de configuración del sistema ERP-CRM: descripción, tipología y uso.",
            "−\tActualización del sistema ERP-CRM y aplicación de actualizaciones.",
            "−\tServicios de acceso al sistema ERP-CRM: características y parámetros de configuración, instalación.",
            "−\tEntornos de desarrollo, pruebas y explotación.",
            "Organización y consulta de la información:",
            "−\tDefinición de campos.",
            "−\tConsultas de acceso a datos.",
            "−\tInterfaces de entrada de datos y de procesos. Formularios.",
            "−\tInformes y listados de la aplicación.",
            "−\tGestión de pedidos, albaranes, facturas, asientos predefinidos, trazabilidad, producción, entre otros.",
            "−\tGráficos.",
            "−\tHerramientas de monitorización y de evaluación del rendimiento.",
            "−\tIncidencias: identificación y resolución.",
            "−\tProcesos de extracción de datos en sistemas de ERP-CRM y almacenes de datos. Automatización.",
            "−\tInteligencia de negocio (Business Intelligence).",
            "Implantación de sistemas ERP-CRM en una empresa:",
            "−\tTipos de empresa. Necesidades de la empresa.",
            "−\tSelección de los módulos del sistema ERP-CRM.",
            "−\tTablas y vistas que es preciso adaptar.",
            "−\tConsultas necesarias para obtener información.",
            "−\tCreación de formularios personalizados.",
            "−\tCreación de informes personalizados.",
            "−\tPaneles de control (Dashboards).",
            "−\tIntegración con otros sistemas de gestión.",
            "Desarrollo de componentes:",
            "−\tArquitectura del ERP-CRM.",
            "−\tLenguaje proporcionado por el sistema ERP-CRM. Características y sintaxis del lenguaje. Declaración de datos. Estructuras de programación. Sentencias del lenguaje.",
            "−\tEntornos de desarrollo y herramientas del sistema ERP y CRM.",
            "−\tInserción, modificación y eliminación de datos en los objetos.",
            "−\tOperaciones de consulta. Herramientas.",
            "−\tFormularios e informes.",
            "−\tProcesamiento de datos y obtención de la información.",
            "−\tLlamadas a funciones, librerías de funciones (APIs).",
            "−\tDepuración y tratamiento de errores."
        ]
    },
    "0492": {
        "name": "Proyecto de desarrollo de aplicaciones multiplataforma",
        "code": "0492",
        "hours": "25",
        "ects": "5",
        "learning_results": [
            {
                "id": "1",
                "description": "Identifica necesidades del sector productivo, relacionándolas con proyectos tipo que puedan satisfacerlas.",
                "evaluation_criteria": [
                    "a) Se han clasificado las empresas del sector por sus características organizativas y el tipo de producto o servicio que ofrecen.",
                    "b) Se han caracterizado las empresas tipo indicando la estructura organizativa y las funciones de cada departamento.",
                    "c) Se han identificado las necesidades más demandadas a las empresas.",
                    "d) Se han valorado las oportunidades de negocio previsibles en el sector.",
                    "e) Se ha identificado el tipo de proyecto requerido para dar respuesta a las demandas previstas.",
                    "f) Se han determinado las características específicas del proyecto según los requerimientos.",
                    "g) Se han determinado las obligaciones fiscales, laborales y de prevención de riesgos y sus condiciones de aplicación.",
                    "h) Se han identificado posibles ayudas o subvenciones para la incorporación de las nuevas tecnologías de producción o de servicio propuestas.",
                    "i) Se ha elaborado el guión de trabajo que se va a seguir para la elaboración del proyecto."
                ]
            },
            {
                "id": "2",
                "description": "Diseña proyectos relacionados con las competencias expresadas en el título, desarrollando explícitamente las fases que lo componen.",
                "evaluation_criteria": [
                    "a) Se ha recopilado información relativa a los aspectos que van a ser tratados en el proyecto.",
                    "b) Se ha realizado el estudio de viabilidad técnica del proyecto.",
                    "c) Se han identificado las fases del proyecto especificando su contenido y plazos de ejecución.",
                    "d) Se han establecido los objetivos que se pretenden conseguir identificando su alcance.",
                    "e) Se han determinado las actividades necesarias para el desarrollo del proyecto.",
                    "f) Se han previsto los recursos materiales y personales necesarios para realizar el proyecto.",
                    "g) Se han identificado las necesidades de financiación para la puesta en marcha del proyecto.",
                    "h) Se ha definido y elaborado la documentación necesaria para su diseño.",
                    "i) Se han identificado los aspectos que se deben controlar para garantizar la calidad del proyecto."
                ]
            },
            {
                "id": "3",
                "description": "Planifica la ejecución del proyecto, determinando el plan de intervención y la documentación asociada.",
                "evaluation_criteria": [
                    "a) Se han secuenciado las tareas en función de las necesidades de implementación.",
                    "b) Se han determinado los recursos y la logística necesaria para cada tarea.",
                    "c) Se han identificado las necesidades de permisos y autorizaciones para llevar a cabo las tareas.",
                    "d) Se han determinado los procedimientos para ejecución de las tareas.",
                    "e) Se han identificado los riesgos inherentes a la ejecución del proyecto, definiendo el plan de prevención de riesgos y los medios necesarios.",
                    "f) Se ha planificado la asignación de recursos materiales y humanos según los tiempos de ejecución.",
                    "g) Se ha hecho la valoración económica que da respuesta a las condiciones de la ejecución del proyecto.",
                    "h) Se ha definido y elaborado la documentación necesaria para la ejecución del proyecto."
                ]
            },
            {
                "id": "4",
                "description": "Define los procedimientos para el seguimiento y control en la ejecución del proyecto, justificando la selección de variables e instrumentos empleados.",
                "evaluation_criteria": [
                    "a) Se ha definido el procedimiento de evaluación de las actividades o intervenciones realizadas durante la ejecución del proyecto.",
                    "b) Se han definido los indicadores de calidad para realizar la evaluación del proyecto.",
                    "c) Se ha definido el procedimiento para el registro y evaluación de las incidencias que puedan presentarse durante la ejecución del proyecto.",
                    "d) Se ha definido el procedimiento para la solución de las incidencias registradas.",
                    "e) Se ha definido el procedimiento para la gestión y registro de los cambios en los recursos y en las tareas.",
                    "f) Se ha establecido el procedimiento para la participación en la evaluación de los usuarios y se han elaborado documentos específicos.",
                    "g) Se ha establecido un sistema para garantizar el cumplimiento del pliego de condiciones del proyecto cuando este existe."
                ]
            }
        ],
        "contents": []
    },
    "0493": {
        "name": "Formación y orientación laboral",
        "code": "0493",
        "hours": "50",
        "ects": "5",
        "learning_results": [
            {
                "id": "1",
                "description": "Selecciona oportunidades de empleo, identificando las diferentes posibilidades de inserción y las alternativas de aprendizaje a lo largo de la vida.",
                "evaluation_criteria": [
                    "a)\tSe ha valorado la importancia de la formación permanente como factor clave para la empleabilidad y la adaptación a las exigencias del proceso productivo.",
                    "b)\tSe han identificado los itinerarios formativos-profesionales relacionados con el perfil profesional del técnico en Desarrollo de aplicaciones multiplataforma.",
                    "c)\tSe han determinado las aptitudes y actitudes requeridas para la actividad profesional relacionada con el perfil del título.",
                    "d)\tSe han identificado los principales yacimientos de empleo y de inserción laboral para el técnico en Desarrollo de aplicaciones multiplataforma.",
                    "e)\tSe han determinado las técnicas utilizadas en el proceso de búsqueda de empleo.",
                    "f)\tSe han previsto las alternativas de autoempleo en los sectores profesionales relacionados con el título.",
                    "g)\tSe ha realizado la valoración de la personalidad, aspiraciones, actitudes, y formación propia para la toma de decisiones."
                ]
            },
            {
                "id": "2",
                "description": "Aplica las estrategias del trabajo en equipo, valorando su eficacia y eficiencia para la consecución de los objetivos de la organización.",
                "evaluation_criteria": [
                    "a)\tSe han valorado las ventajas de trabajo en equipo en situaciones de trabajo relacionadas con el perfil del técnico en Desarrollo de aplicaciones multiplataforma.",
                    "b)\tSe han identificado los equipos de trabajo que pueden constituirse en una situación real de trabajo.",
                    "c)\tSe han determinado las características del equipo de trabajo eficaz frente a los equipos ineficaces.",
                    "d)\tSe ha valorado positivamente la necesaria existencia de diversidad de roles y opiniones asumidos por los miembros de un equipo.",
                    "e)\tSe ha reconocido la posible existencia de conflicto entre los miembros de un grupo como un aspecto característico de las organizaciones.",
                    "f)\tSe han identificado los tipos de conflictos y sus fuentes.",
                    "g)\tSe han determinado procedimientos para la resolución del conflicto."
                ]
            },
            {
                "id": "3",
                "description": "Ejerce los derechos y cumple las obligaciones que se derivan de las relaciones laborales, reconociéndolas en los diferentes contratos de trabajo.",
                "evaluation_criteria": [
                    "a)\tSe han identificado los conceptos básicos del derecho del trabajo.",
                    "b)\tSe han distinguido los principales organismos que intervienen en las relaciones entre empresarios y trabajadores.",
                    "c)\tSe han determinado los derechos y obligaciones derivados de la relación laboral.",
                    "d)\tSe han clasificado las principales modalidades de contratación, identificando las medidas de fomento de la contratación para determinados colectivos.",
                    "e)\tSe han valorado las medidas establecidas por la legislación vigente para la conciliación de la vida laboral y familiar.",
                    "f)\tSe han identificado las causas y efectos de la modificación, suspensión y extinción de la relación laboral.",
                    "g)\tSe ha analizado el recibo de salarios, identificando los principales elementos que lo integran.",
                    "h)\tSe han analizado las diferentes medidas de conflicto colectivo y los procedimientos de solución de conflictos.",
                    "i)\tSe han determinado las condiciones de trabajo pactadas en un convenio colectivo aplicable a un sector profesional relacionado con el título de técnico en Desarrollo de aplicaciones multiplataforma.",
                    "j)\tSe han identificado las características definitorias de los nuevos entornos de organización del trabajo."
                ]
            },
            {
                "id": "4",
                "description": "Determina la acción protectora del sistema de la Seguridad Social ante las distintas contingencias cubiertas, identificando las distintas clases de prestaciones.",
                "evaluation_criteria": [
                    "a)\tSe ha valorado el papel de la Seguridad Social como pilar esencial para la mejora de la calidad de vida de los ciudadanos.",
                    "b)\tSe han enumerado las diversas contingencias que cubre el sistema de Seguridad Social.",
                    "c)\tSe han identificado los regímenes existentes en el sistema de la Seguridad Social.",
                    "d)\tSe han identificado las obligaciones de empresario y trabajador dentro del sistema de Seguridad Social.",
                    "e)\tSe han identificado, en un supuesto sencillo, las bases de cotización de un trabajador y las cuotas correspondientes a trabajador y empresario.",
                    "f)\tSe han clasificado las prestaciones del sistema de Seguridad Social, identificando los requisitos.",
                    "g)\tSe han determinado las posibles situaciones legales de desempleo en supuestos prácticos sencillos.",
                    "h)\tSe ha realizado el cálculo de la duración y cuantía de una prestación por desempleo de nivel contributivo básico."
                ]
            },
            {
                "id": "5",
                "description": "Evalúa los riesgos derivados de su actividad, analizando las condiciones de trabajo y los factores de riesgo presentes en su entorno laboral.",
                "evaluation_criteria": [
                    "a)\tSe ha valorado la importancia de la cultura preventiva en todos los ámbitos y actividades de la empresa.",
                    "b)\tSe han relacionado las condiciones laborales con la salud del trabajador.",
                    "c)\tSe han clasificado los factores de riesgo en la actividad y los daños derivados de los mismos.",
                    "d)\tSe han identificado las situaciones de riesgo más habituales en los entornos de trabajo del técnico en Desarrollo de aplicaciones multiplataforma.",
                    "e)\tSe ha determinado la evaluación de riesgos en la empresa.",
                    "f)\tSe han determinado las condiciones de trabajo con significación para la prevención en los entornos de trabajo relacionados con el perfil profesional del técnico en Desarrollo de aplicaciones multiplataforma.",
                    "g)\tSe han clasificado y descrito los tipos de daños profesionales, con especial referencia a accidentes de trabajo y enfermedades profesionales, relacionados con el perfil profesional del Técnico en Desarrollo de Aplicaciones Multiplataforma."
                ]
            },
            {
                "id": "6",
                "description": "Participa en la elaboración de un plan de prevención de riesgos en una pequeña empresa, identificando las responsabilidades de todos los agentes implicados.",
                "evaluation_criteria": [
                    "a)\tSe han determinado los principales derechos y deberes en materia de prevención de riesgos laborales.",
                    "b)\tSe han clasificado las distintas formas de gestión de la prevención en la empresa, en función de los diferentes criterios establecidos en la normativa sobre prevención de riesgos laborales.",
                    "c)\tSe han determinado las formas de representación de los trabajadores en la empresa en materia de prevención de riesgos.",
                    "d)\tSe han identificado los organismos públicos relacionados con la prevención de riesgos laborales.",
                    "e)\tSe ha valorado la importancia de la existencia de un plan preventivo en la empresa que incluya la secuenciación de actuaciones que se deben realizar en caso de emergencia.",
                    "f)\tSe ha definido el contenido del plan de prevención en un centro de trabajo relacionado con el sector profesional del técnico en Desarrollo de aplicaciones multiplataforma.",
                    "g)\tSe ha proyectado un plan de emergencia y evacuación en una pequeña y mediana empresa."
                ]
            },
            {
                "id": "7",
                "description": "Aplica las medidas de prevención y protección, analizando las situaciones de riesgo en el entorno laboral del técnico en Desarrollo de aplicaciones multiplataforma.",
                "evaluation_criteria": [
                    "a)\tSe han definido las técnicas de prevención y de protección individual y colectiva que deben aplicarse para evitar los daños en su origen y minimizar sus consecuencias en caso de que sean inevitables.",
                    "b)\tSe ha analizado el significado y alcance de los distintos tipos de señalización de seguridad.",
                    "c)\tSe han analizado los protocolos de actuación en caso de emergencia.",
                    "d)\tSe han identificado las técnicas de clasificación de heridos en caso de emergencia donde existan víctimas de diversa gravedad.",
                    "e)\tSe han identificado las técnicas básicas de primeros auxilios que han de ser aplicadas en el lugar del accidente ante distintos tipos de daños y la composición y uso del botiquín.",
                    "f)\tSe han determinado los requisitos y condiciones para la vigilancia de la salud del trabajador y su importancia como medida de prevención."
                ]
            }
        ],
        "contents": [
            "Búsqueda activa de empleo:",
            "−\tValoración de la importancia de la formación permanente para la trayectoria laboral y profesional del técnico en Desarrollo de aplicaciones multiplataforma.",
            "−\tAnálisis de los intereses, aptitudes y motivaciones personales para la carrera profesional.",
            "−\tIdentificación de itinerarios formativos relacionados con el técnico en Desarrollo de aplicaciones multiplataforma.",
            "−\tDefinición y análisis del sector profesional del Técnico en Desarrollo de Aplicaciones Multiplataforma.",
            "−\tProceso de búsqueda de empleo en empresas del sector.",
            "−\tOportunidades de aprendizaje y empleo en Europa.",
            "−\tTécnicas e instrumentos de búsqueda de empleo.",
            "−\tEl proceso de toma de decisiones.",
            "Gestión del conflicto y equipos de trabajo:",
            "−\tValoración de las ventajas e inconvenientes del trabajo de equipo para la eficacia de la organización.",
            "−\tEquipos en la industria de Desarrollo de aplicaciones multiplataforma según las funciones que desempeñan.",
            "−\tLa participación en el equipo de trabajo.",
            "−\tConflicto: Características, fuentes y etapas.",
            "−\tMétodos para la resolución o supresión del conflicto.",
            "Contrato de trabajo:",
            "−\tEl derecho del trabajo.",
            "−\tAnálisis de la relación laboral individual.",
            "−\tModalidades de contrato de trabajo y medidas de fomento de la contratación.",
            "−\tDerechos y deberes derivados de la relación laboral.",
            "−\tModificación, suspensión y extinción del contrato de trabajo.",
            "−\tRepresentación de los trabajadores.",
            "−\tAnálisis de un convenio colectivo aplicable al ámbito profesional del Técnico en Desarrollo de aplicaciones multiplataforma.",
            "−\tBeneficios para los trabajadores en las nuevas organizaciones: flexibilidad, beneficios sociales, entre otros.",
            "Seguridad Social, Empleo y Desempleo:",
            "−\tEstructura del Sistema de la Seguridad Social.",
            "−\tDeterminación de las principales obligaciones de empresarios y trabajadores en materia de Seguridad Social, afiliación, altas, bajas y cotización.",
            "−\tSituaciones protegibles en la protección por desempleo.",
            "Evaluación de riesgos profesionales:",
            "−\tValoración de la relación entre trabajo y salud.",
            "−\tAnálisis de factores de riesgo.",
            "−\tLa evaluación de riesgos en la empresa como elemento básico de la actividad preventiva.",
            "−\tAnálisis de riesgos ligados a las condiciones de seguridad.",
            "−\tAnálisis de riesgos ligados a las condiciones ambientales.",
            "−\tAnálisis de riesgos ligados a las condiciones ergonómicas y psico-sociales.",
            "−\tRiesgos específicos en la industria de Desarrollo de aplicaciones multiplataforma.",
            "−\tDeterminación de los posibles daños a la salud del trabajador que pueden derivarse de las situaciones de riesgo detectadas.",
            "Planificación de la prevención de riesgos en la empresa:",
            "−\tDerechos y deberes en materia de prevención de riesgos laborales.",
            "−\tGestión de la prevención en la empresa.",
            "−\tOrganismos públicos relacionados con la prevención de riesgos laborales.",
            "−\tPlanificación de la prevención en la empresa.",
            "−\tPlanes de emergencia y de evacuación en entornos de trabajo.",
            "−\tElaboración de un plan de emergencia en una pyme.",
            "Aplicación de medidas de prevención y protección en la empresa:",
            "−\tDeterminación de las medidas de prevención y protección individual y colectiva.",
            "−\tProtocolo de actuación ante una situación de emergencia.",
            "−\tPrimeros auxilios."
        ]
    },
    "0494 ": {
        "name": "Empresa e iniciativa emprendedora",
        "code": "0494 ",
        "hours": "35",
        "ects": "4",
        "learning_results": [
            {
                "id": "1",
                "description": "Reconoce las capacidades asociadas a la iniciativa emprendedora, analizando los requerimientos derivados de los puestos de trabajo y de las actividades empresariales.",
                "evaluation_criteria": [
                    "a)\tSe ha identificado el concepto de innovación y su relación con el progreso de la sociedad y el aumento en el bienestar de los individuos.",
                    "b)\tSe ha analizado el concepto de cultura emprendedora y su importancia como fuente de creación de empleo y bienestar social.",
                    "c)\tSe ha valorado la importancia de la iniciativa individual, la creatividad, la formación y la colaboración como requisitos indispensables para tener éxito en la actividad emprendedora.",
                    "d)\tSe ha analizado la capacidad de iniciativa en el trabajo de una persona empleada en una pyme dedicada al desarrollo de aplicaciones multiplataforma.",
                    "e)\tSe ha analizado el desarrollo de la actividad emprendedora de un empresario que se inicie en el sector de la informática.",
                    "f)\tSe ha analizado el concepto de riesgo como elemento inevitable de toda actividad emprendedora.",
                    "g)\tSe ha analizado el concepto de empresario y los requisitos y actitudes necesarios para desarrollar la actividad empresarial.",
                    "h)\tSe ha descrito la estrategia empresarial relacionándola con los objetivos de la empresa.",
                    "i)\tSe ha definido una determinada idea de negocio del ámbito del desarrollo de aplicaciones multiplataforma, que servirá de punto de partida para la elaboración de un plan de empresa."
                ]
            },
            {
                "id": "2",
                "description": "Define la oportunidad de creación de una pequeña empresa, valorando el impacto sobre el entorno de actuación e incorporando valores éticos.",
                "evaluation_criteria": [
                    "a)\tSe han descrito las funciones básicas que se realizan en una empresa y se ha analizado el concepto de sistema aplicado a la empresa.",
                    "b)\tSe han identificado los principales componentes del entorno general que rodea a la empresa, en especial el entorno económico, social, demográfico y cultural.",
                    "c)\tSe ha analizado la influencia en la actividad empresarial de las relaciones con los clientes, con los proveedores y con la competencia como principales integrantes del entorno específico.",
                    "d)\tSe han identificado los elementos del entorno de una pyme de informática.",
                    "e)\tSe han analizado los conceptos de cultura empresarial e imagen corporativa y su relación con los objetivos empresariales.",
                    "f)\tSe ha analizado el fenómeno de la responsabilidad social de las empresas y su importancia como un elemento de la estrategia empresarial.",
                    "g)\tSe ha elaborado el balance social de una empresa de informática, y se han descrito los principales costes sociales en que incurren estas empresas, así como los beneficios sociales que producen.",
                    "h)\tSe han identificado, en empresas de informática, prácticas que incorporan valores éticos y sociales.",
                    "i)\tSe ha llevado a cabo un estudio de viabilidad económica y financiera de una pyme de Desarrollo de aplicaciones multiplataforma."
                ]
            },
            {
                "id": "3",
                "description": "Realiza actividades para la constitución y puesta en marcha de una empresa, seleccionando la forma jurídica e identificando las obligaciones legales asociadas.",
                "evaluation_criteria": [
                    "a)\tSe han analizado las diferentes formas jurídicas de la empresa.",
                    "b)\tSe ha especificado el grado de responsabilidad legal de los propietarios de la empresa en función de la forma jurídica elegida.",
                    "c)\tSe ha diferenciado el tratamiento fiscal establecido para las diferentes formas jurídicas de la empresa.",
                    "d)\tSe han analizado los trámites exigidos por la legislación vigente para la constitución de una pyme.",
                    "e)\tSe ha realizado una búsqueda exhaustiva de las diferentes ayudas para la creación de empresas de informática en la localidad de referencia.",
                    "f)\tSe ha incluido en el plan de empresa todo lo relativo a la elección de la forma jurídica, estudio de viabilidad económico-financiera, trámites administrativos, ayudas y subvenciones.",
                    "g)\tSe han identificado las vías de asesoramiento y gestión administrativa externas existentes a la hora de poner en marcha una pyme."
                ]
            },
            {
                "id": "4",
                "description": "Realiza actividades de gestión administrativa y financiera de una pyme, identificando las principales obligaciones contables y fiscales y cumplimentando la documentación.",
                "evaluation_criteria": [
                    "a)\tSe han analizado los conceptos básicos de contabilidad, así como las técnicas de registro de la información contable.",
                    "b)\tSe han descrito las técnicas básicas de análisis de la información contable, en especial en lo referente a la solvencia, liquidez y rentabilidad de la empresa.",
                    "c)\tSe han definido las obligaciones fiscales de una empresa de informática.",
                    "d)\tSe han diferenciado los tipos de impuestos en el calendario fiscal.",
                    "e)\tSe ha cumplimentado la documentación básica de carácter comercial y contable (facturas, albaranes, notas de pedido, letras de cambio, cheques y otros) para una pyme de informática, y se han descrito los circuitos que dicha documentación recorre en la empresa.",
                    "f)\tSe han identificado los principales instrumentos de financiación bancaria.",
                    "g)\tSe ha incluido la anterior documentación en el plan de empresa."
                ]
            }
        ],
        "contents": [
            "Iniciativa emprendedora:",
            "−\tInnovación y desarrollo económico. Principales características de la innovación en la actividad de desarrollo de aplicaciones multiplataforma (materiales, tecnología, organización, entre otros).",
            "−\tFactores claves de los emprendedores: iniciativa, creatividad y formación.",
            "−\tLa actuación de los emprendedores como empleados de una empresa de informática.",
            "−\tLa actuación de los emprendedores como empresarios, de una pequeña empresa en el sector de la informática.",
            "−\tEl empresario. Requisitos para el ejercicio de la actividad empresarial.",
            "−\tPlan de empresa: La idea de negocio en el ámbito de la informática.",
            "La empresa y su entorno:",
            "−\tFunciones básicas de la empresa.",
            "−\tLa empresa como sistema.",
            "−\tAnálisis del entorno general de una pyme de informática.",
            "−\tAnálisis del entorno específico de una pyme de informática.",
            "−\tRelaciones de una pyme de informática con su entorno.",
            "−\tRelaciones de una pyme de informática con el conjunto de la sociedad.",
            "Creación y puesta en marcha de una empresa:",
            "−\tTipos de empresa.",
            "−\tLa fiscalidad en las empresas.",
            "−\tElección de la forma jurídica.",
            "−\tTrámites administrativos para la constitución de una empresa.",
            "−\tViabilidad económica y viabilidad financiera de una pyme de informática.",
            "−\tPlan de empresa: Elección de la forma jurídica, estudio de viabilidad económica y financiera, trámites administrativos y gestión de ayudas y subvenciones.",
            "Función administrativa:",
            "−\tConcepto de contabilidad y nociones básicas.",
            "−\tAnálisis de la información contable.",
            "−\tObligaciones fiscales de las empresas.",
            "−\tGestión administrativa de una empresa de informática."
        ]
    },
    "0495": {
        "name": "Formación en Centros de Trabajo",
        "code": "0495",
        "hours": "220",
        "ects": "22",
        "learning_results": [
            {
                "id": "1",
                "description": "Identifica la estructura y organización de la empresa relacionándola con el desarrollo y comercialización de los productos que obtiene.",
                "evaluation_criteria": [
                    "a)\tSe ha identificado la estructura organizativa de la empresa y las funciones de cada área de la misma.",
                    "b)\tSe han reconocido las relaciones organizativas y funcionales del departamento de control de calidad con los demás departamentos de la empresa.",
                    "c)\tSe han identificado los elementos que constituyen la red logística de la empresa: proveedores, clientes, sistemas de producción, almacenaje y otros.",
                    "d)\tSe han identificado los procedimientos de trabajo en el desarrollo del proceso productivo.",
                    "e)\tSe han relacionado las competencias profesionales, personales y sociales de los recursos humanos con el desarrollo de la actividad productiva.",
                    "f)\tSe han relacionado características del mercado, tipos de clientes y proveedores y su posible influencia en el desarrollo de la actividad empresarial.",
                    "g)\tSe han identificado los canales de comercialización más frecuentes en esta actividad.",
                    "h)\tSe han valorado las ventajas e inconvenientes de la estructura de la empresa frente a otro tipo de organizaciones empresariales."
                ]
            },
            {
                "id": "2",
                "description": "Ejerce la actividad profesional aplicando hábitos éticos y laborales acordes con las características del puesto de trabajo y los procedimientos establecidos en la empresa.",
                "evaluation_criteria": [
                    "a)\tSe han reconocido y justificado:",
                    "b)\tSe han identificado las normas de prevención de riesgos laborales que hay que aplicar en la actividad profesional y los aspectos fundamentales de la Ley de Prevención de Riesgos Laborales.",
                    "c)\tSe han utilizado equipos de protección individual adecuados a los riesgos de la actividad profesional y a las normas de la empresa.",
                    "d)\tSe ha mantenido una actitud clara de respeto al medio ambiente en las actividades desarrolladas y aplicado las normas internas y externas al respecto.",
                    "e)\tSe ha mantenido organizado, limpio y libre de obstáculos el puesto de trabajo o área correspondiente al desarrollo de la actividad.",
                    "f)\tSe han interpretado y cumplido las instrucciones recibidas, responsabilizándose del trabajo asignado.",
                    "g)\tSe ha establecido una comunicación y relación eficaz con la persona responsable en cada situación y miembros de su equipo, manteniendo un trato fluido y correcto.",
                    "h)\tSe ha valorado la importancia de su actividad y la adaptación a los cambios de tareas asignadas en el desarrollo de los procesos productivos de la empresa, integrándose en las nuevas funciones.",
                    "i)\tSe ha comprometido responsablemente en la aplicación de las normas y procedimientos en el desarrollo de cualquier actividad o tarea."
                ]
            },
            {
                "id": "3",
                "description": "Organiza los trabajos a desarrollar, identificando las tareas asignadas a partir de la planificación de proyectos e interpretando documentación específica.",
                "evaluation_criteria": [
                    "a)\tSe ha interpretado la normativa o bibliografía adecuada al tipo de tarea a desarrollar.",
                    "b)\tSe ha reconocido en que fases del proceso o proyecto se encuadran las tareas a realizar.",
                    "c)\tSe ha planificado el trabajo para cada tarea, secuenciando y priorizando sus fases.",
                    "d)\tSe han identificado los equipos y servicios auxiliares necesarios para el desarrollo de la tarea encomendada.",
                    "e)\tSe ha organizado el aprovisionamiento y almacenaje de los recursos necesarios.",
                    "f)\tSe ha valorado el orden y el método en la realización de las tareas.",
                    "g)\tSe han identificado las normativas que sea preciso observar según cada tarea."
                ]
            },
            {
                "id": "4",
                "description": "Gestiona y utiliza sistemas informáticos y entornos de desarrollo, evaluando sus requerimientos y características en función del propósito de uso.",
                "evaluation_criteria": [
                    "a)\tSe ha trabajado sobre diferentes sistemas informáticos, identificando en cada caso su hardware, sistemas operativos y aplicaciones instaladas y las restricciones o condiciones específicas de uso.",
                    "b)\tSe ha gestionado la información en diferentes sistemas, aplicando medidas que aseguren la integridad y disponibilidad de los datos.",
                    "c)\tSe ha participado en la gestión de recursos en red identificando las restricciones de seguridad existentes.",
                    "d)\tSe han utilizado aplicaciones informáticas para elaborar, distribuir y mantener documentación técnica y de asistencia a usuarios.",
                    "e)\tSe han utilizado entornos de desarrollo para editar, depurar, probar y documentar código, además de generar ejecutables.",
                    "f)\tSe han gestionado entornos de desarrollo añadiendo y empleando complementos específicos en las distintas fases de proyectos de desarrollo."
                ]
            },
            {
                "id": "5",
                "description": "Participa en el desarrollo de aplicaciones con acceso a datos planificando la estructura de la base de datos y evaluando el alcance y la repercusión de las transacciones.",
                "evaluation_criteria": [
                    "a)\tSe ha interpretado el diseño lógico de bases de datos que aseguran la accesibilidad a los datos.",
                    "b)\tSe ha participado en la materialización del diseño lógico sobre algún sistema gestor de bases de datos.",
                    "c)\tSe han utilizado bases de datos aplicando técnicas para mantener la persistencia de la información.",
                    "d)\tSe han ejecutado consultas directas y procedimientos capaces de gestionar y almacenar objetos y datos de la base de datos.",
                    "e)\tSe han establecido conexiones con bases de datos para ejecutar consultas y recuperar los resultados en objetos de acceso a datos.",
                    "f)\tSe han desarrollado formularios e informes como parte de aplicaciones que gestionan de forma integral la información almacenada en una base de datos.",
                    "g)\tSe ha comprobado la configuración de los servicios de red para garantizar la ejecución segura de las aplicaciones Cliente-Servidor.",
                    "h)\tSe ha elaborado la documentación asociada a la gestión de las bases de datos empleadas y las aplicaciones desarrolladas."
                ]
            },
            {
                "id": "6",
                "description": "Interviene en el desarrollo de juegos, aplicaciones multimedia y aplicaciones para dispositivos móviles empleando las herramientas y lenguajes específicos y cumpliendo el guión y las especificaciones establecidas.",
                "evaluation_criteria": [
                    "a)\tSe ha manipulado material multimedia en múltiples formatos, analizando y utilizando librerías específicas para la conversión entre formatos y para la integración de contenidos multimedia en una aplicación.",
                    "b)\tSe ha participado en la preparación e integración de materiales multimedia en una aplicación, siguiendo las instrucciones del equipo de diseño.",
                    "c)\tSe han utilizado y gestionado entornos de desarrollo específicos para aplicaciones destinadas a dispositivos móviles, así como entornos y motores para el desarrollo de juegos.",
                    "d)\tSe ha colaborado en el desarrollo de aplicaciones interactivas para dispositivos móviles, basadas en el manejo de eventos y en la integración de elementos interactivos y animaciones.",
                    "e)\tSe ha verificado la usabilidad de las aplicaciones desarrolladas, colaborando en los cambios y medidas necesarias para cumplir los niveles exigidos.",
                    "f)\tSe ha participado en el desarrollo de juegos y aplicaciones en el ámbito del entretenimiento empleando distintas técnicas, motores y entornos de desarrollo."
                ]
            },
            {
                "id": "7",
                "description": "Colabora en el desarrollo y prueba de aplicaciones multiplataforma, desde la interfaz hasta la programación de procesos y servicios, incluyendo su empaquetado y distribución así como todas las ayudas y documentación asociadas.",
                "evaluation_criteria": [
                    "a)\tSe ha participado en el desarrollo de la interfaz para aplicaciones multiplataforma empleando componentes visuales estándar o definiendo componentes personalizados.",
                    "b)\tSe han creado ayudas generales y ayudas sensibles al contexto para las aplicaciones desarrolladas, empleando herramientas específicas.",
                    "c)\tSe han creado tutoriales, manuales de usuario, de instalación y de configuración de las aplicaciones desarrolladas.",
                    "d)\tSe han empaquetado aplicaciones para su distribución preparando paquetes auto instalables con la aplicación y todos sus elementos de ayuda y asistencia incorporados.",
                    "e)\tSe han aplicado técnicas de programación multihilo y mecanismos de comunicación habitualmente empleados para desarrollar aplicaciones en red, valorando su repercusión.",
                    "f)\tSe ha participado en la definición y elaboración de la documentación y del resto de componentes empleados en los protocolos de asistencia al usuario de la aplicación."
                ]
            },
            {
                "id": "8",
                "description": "Participa en el proceso de implantación y adaptación de sistemas de gestión de recursos y de planificación empresarial (ERP-CRM) analizando sus características y valorando los cambios realizados.",
                "evaluation_criteria": [
                    "a)\tSe ha reconocido la funcionalidad de los sistemas ERP-CRM en un supuesto empresarial real, evaluando la utilidad de cada uno de sus módulos.",
                    "b)\tSe ha participado en la instalación y configuración de sistemas ERP-CRM.",
                    "c)\tSe ha valorado y analizado el proceso de adaptación de un sistema ERP-CRM a los requerimientos de un supuesto empresarial real.",
                    "d)\tSe ha intervenido en la gestión de la información almacenada en sistemas ERP-CRM garantizando su integridad.",
                    "e)\tSe ha colaborado en el desarrollo de componentes personalizados para un sistema ERP-CRM, utilizando el lenguaje de programación proporcionado por el sistema."
                ]
            },
            {
                "id": "0483",
                "description": "Sistemas informáticos.",
                "evaluation_criteria": []
            },
            {
                "id": "0484",
                "description": "Bases de Datos.",
                "evaluation_criteria": []
            },
            {
                "id": "0485",
                "description": "Programación.",
                "evaluation_criteria": []
            },
            {
                "id": "0373",
                "description": "Lenguajes de marcas y sistemas de gestión de información.",
                "evaluation_criteria": []
            },
            {
                "id": "0487",
                "description": "Entornos de desarrollo.",
                "evaluation_criteria": []
            },
            {
                "id": "0486",
                "description": "Acceso a datos.",
                "evaluation_criteria": []
            },
            {
                "id": "0488",
                "description": "Desarrollo de interfaces.",
                "evaluation_criteria": []
            },
            {
                "id": "0489",
                "description": "Programación multimedia y dispositivos móviles.",
                "evaluation_criteria": []
            },
            {
                "id": "0490",
                "description": "Programación de servicios y procesos.",
                "evaluation_criteria": []
            },
            {
                "id": "0491",
                "description": "Sistemas de gestión empresarial.",
                "evaluation_criteria": []
            },
            {
                "id": "0492",
                "description": "Proyecto de desarrollo de aplicaciones multiplataforma.",
                "evaluation_criteria": []
            },
            {
                "id": "0493",
                "description": "Formación y orientación laboral.",
                "evaluation_criteria": []
            },
            {
                "id": "0494",
                "description": "Empresa e iniciativa emprendedora.",
                "evaluation_criteria": []
            },
            {
                "id": "0490",
                "description": "Programación de servicios y procesos.",
                "evaluation_criteria": []
            },
            {
                "id": "0492",
                "description": "Proyecto de desarrollo de aplicaciones multiplataforma.",
                "evaluation_criteria": []
            },
            {
                "id": "0483",
                "description": "Sistemas informáticos.",
                "evaluation_criteria": []
            },
            {
                "id": "0484",
                "description": "Bases de Datos.",
                "evaluation_criteria": []
            },
            {
                "id": "0486",
                "description": "Acceso a datos.",
                "evaluation_criteria": []
            },
            {
                "id": "0485",
                "description": "Programación.",
                "evaluation_criteria": []
            },
            {
                "id": "0487",
                "description": "Entornos de desarrollo.",
                "evaluation_criteria": []
            },
            {
                "id": "0488",
                "description": "Desarrollo de interfaces.",
                "evaluation_criteria": []
            },
            {
                "id": "0495",
                "description": "Formación en centros de trabajo.",
                "evaluation_criteria": []
            },
            {
                "id": "0483",
                "description": "Sistemas informáticos.",
                "evaluation_criteria": []
            },
            {
                "id": "0484",
                "description": "Bases de Datos.",
                "evaluation_criteria": []
            },
            {
                "id": "0486",
                "description": "Acceso a datos.",
                "evaluation_criteria": []
            },
            {
                "id": "0488",
                "description": "Desarrollo de interfaces.",
                "evaluation_criteria": []
            },
            {
                "id": "0490",
                "description": "Programación de servicios y procesos.",
                "evaluation_criteria": []
            },
            {
                "id": "0491",
                "description": "Sistemas de gestión empresarial.",
                "evaluation_criteria": []
            },
            {
                "id": "0483",
                "description": "Sistemas informáticos.",
                "evaluation_criteria": []
            },
            {
                "id": "0484",
                "description": "Bases de Datos.",
                "evaluation_criteria": []
            },
            {
                "id": "0486",
                "description": "Acceso a datos.",
                "evaluation_criteria": []
            },
            {
                "id": "0488",
                "description": "Desarrollo de interfaces.",
                "evaluation_criteria": []
            },
            {
                "id": "0490",
                "description": "Programación de servicios y procesos.",
                "evaluation_criteria": []
            },
            {
                "id": "0491",
                "description": "Sistemas de gestión empresarial.",
                "evaluation_criteria": []
            }
        ],
        "contents": []
    },
    "1709": {
        "name": "Itinerario personal para la empleabilidad I",
        "code": "1709",
        "hours": "50",
        "ects": "5",
        "learning_results": [
            {
                "id": "1",
                "description": "Distingue las características del sector productivo y define los puestos de trabajo relacionándolos con las competencias profesionales expresadas en el título.",
                "evaluation_criteria": [
                    "a) Se han analizado las principales oportunidades de empleo y de inserción laboral en el sector profesional, identificando las posibilidades de empleo y analizado sus requerimientos actuales para el perfil profesional.",
                    "b) Se ha comparado los diferentes requerimientos exigidos por el mercado laboral con las exigencias para el trabajo en la función pública relacionados con el sector privado.",
                    "c) Se ha reflexionado sobre las actitudes y aptitudes requeridas actualmente para la actividad profesional relacionadas con el título, así como las competencias personales y sociales más relevantes para el sector identificando nuestra zona de desarrollo próximo."
                ]
            },
            {
                "id": "2",
                "description": "Alcanza las competencias necesarias para la obtención del título de Técnico Básico en Prevención de Riesgos Laborales.",
                "evaluation_criteria": [
                    "a) Se ha valorado la importancia de la cultura preventiva en todos los ámbitos actividades de la empresa u organismo equiparado relacionado las condiciones laborales con la salud de la persona trabajadora identificando y clasificando los factores de riesgo en la actividad y los daños derivados de los mismos, especialmente las situaciones de riesgo más habituales en los entornos de trabajo del sector profesional relacionado con el título.",
                    "b) Se han clasificado y descrito los tipos de daños profesionales, con especial referencia a accidentes de trabajo y enfermedades profesionales, relacionados con el perfil profesional del título.",
                    "c) Se ha determinado la evaluación de riesgos en la empresa u organismo equiparado y definido las técnicas de prevención y de protección que deben aplicarse para evitar los daños en su origen y minimizar sus consecuencias.",
                    "d) Se han analizado los protocolos de actuación en caso de emergencia.",
                    "e) Se han determinado los principales derechos y deberes en materia de prevención de riesgos laborales.",
                    "f) Se han clasificado las distintas formas de gestión de la prevención en la empresa u organismo equiparado, en función de los distintos criterios establecidos en la normativa sobre prevención de riesgos laborales y determinado las formas de representación de las personas trabajadoras en la empresa u organismo equiparado en materia de prevención de riesgos.",
                    "g) Se ha valorado la importancia de la existencia de un plan preventivo en la empresa u organismo equiparado que incluya la secuenciación de actuaciones a realizar en caso de emergencia y reflexionado sobre el contenido del mismo.",
                    "h) Se han determinado los requisitos y condiciones para la vigilancia de la salud de la persona trabajadora y su importancia como medida de prevención.",
                    "i) Se han identificado las técnicas básicas de primeros auxilios que han de ser aplicadas en el lugar del accidente ante distintos tipos de daños y la composición y uso del botiquín."
                ]
            },
            {
                "id": "3",
                "description": "Analiza sus condiciones laborales como persona trabajadora por cuenta ajena identificándolas en los principales tipos de cambios y vicisitudes relevantes que se pueden presentar en la relación laboral en la normativa laboral y especialmente en el convenio colectivo del sector.",
                "evaluation_criteria": [
                    "a) Se han analizado los derechos y obligaciones derivados de la relación laboral, así como las condiciones de trabajo pactadas en un convenio colectivo aplicable al sector profesional relacionado con el título.",
                    "b) Se han comparado las principales modalidades de contratación, localizando los diferentes modelos en las fuentes oficiales.",
                    "c) Se han identificado las características definitorias de los nuevos entornos de organización del trabajo y los derechos que conlleva.",
                    "d) Se han identificado los diferentes componentes del recibo de salario.",
                    "e) Se han identificado los recursos laborales existentes ante las diferentes vicisitudes que se pueden dar en la relación laboral.",
                    "f) Se ha valorado el papel de la Seguridad Social como pilar esencial para la mejora de la calidad de vida de los ciudadanos.",
                    "g) Se han analizado las principales prestaciones derivadas de la suspensión y extinción de la relación laboral."
                ]
            },
            {
                "id": "4",
                "description": "Analiza y evalúa su potencial profesional y sus intereses para guiarse en el proceso de autoorientación y elabora una hoja de ruta para la inserción profesional en base al análisis de las competencias, intereses y destrezas personales.",
                "evaluation_criteria": [
                    "a) Se han evaluado los propios intereses, motivaciones, habilidades y destrezas en el marco de un proceso de autoconocimiento.",
                    "b) Se han analizado las cualidades y competencias personales afines a la actividad profesional relacionada con el perfil del título.",
                    "c) Se han determinado las competencias personales y sociales con valor para el empleo.",
                    "d) Se han señalado las preferencias profesionales, intereses y metas en el marco de un proyecto profesional.",
                    "e) Se ha valorado el concepto de autoestima en el proceso de búsqueda de empleo.",
                    "f) Se han identificado las fortalezas, debilidades, amenazas y oportunidades propias para la inserción profesional.",
                    "g) Se han identificado expectativas de futuro para inserción profesional analizando competencias, intereses y destrezas personales.",
                    "h) Se han valorado hitos importantes en la trayectoria vital con valor profesionalizador.",
                    "i) Se han identificado los itinerarios formativos profesionales relacionados con el perfil profesional.",
                    "j) Se han formulado objetivos profesionales y se ha determinado metas personales y profesionales para la mejora de la empleabilidad y las condiciones de inserción laboral.",
                    "k) Se ha trazado un plan de acción para desarrollar las áreas de mejora y potenciar las fortalezas personales con valor para el empleo."
                ]
            },
            {
                "id": "5",
                "description": "Aplica las estrategias para el aprendizaje autónomo reconociendo su valor profesionalizador, diseñando y optimizando su propio entorno de aprendizaje haciendo uso de las tecnologías digitales como herramientas de aprendizaje autónomo, siendo coherente con su identidad digital y sus propios objetivos profesionales planteados en su plan de desarrollo individual.",
                "evaluation_criteria": [
                    "a) Se ha tomado conciencia de la responsabilidad individual en el desarrollo profesional valorando la actitud de aprendizaje permanente para el desarrollo de propias y nuevas competencias.",
                    "b) Se ha identificado la empleabilidad como capacidad de adaptación al entorno laboral.",
                    "c) Se han conocido y utilizado herramientas, fuentes de información, conexiones y actividades para la configuración de un entorno personal de aprendizaje para la empleabilidad.",
                    "d) Se ha puesto en práctica la competencia digital para configurar un entorno personal de aprendizaje para la empleabilidad.",
                    "e) Se ha analizado el concepto de identidad digital y su impacto en la empleabilidad.",
                    "f) Se ha justificado el diseño de su entorno de aprendizaje basado en cómo este mejora la empleabilidad.",
                    "g) Se ha elaborado su plan de desarrollo individual como herramienta para la mejora de la empleabilidad.",
                    "h) Se han aplicado las herramientas de aprendizaje autónomo para su desarrollo personal y profesional.",
                    "i) Se ha diseñado el entorno de aprendizaje que permite alcanzar el plan de desarrollo individual."
                ]
            }
        ],
        "contents": []
    },
    "1710": {
        "name": "Itinerario personal para la empleabilidad II",
        "code": "1710",
        "hours": "50",
        "ects": "5",
        "learning_results": [
            {
                "id": "1",
                "description": "Planifica y pone en marcha estrategias en los diferentes procesos selectivos de empleo que le permiten mejorar sus posibilidades de inserción laboral.",
                "evaluation_criteria": [
                    "a) Se han determinado las técnicas utilizadas actualmente en el sector para el proceso de selección de personal.",
                    "b) Se han desarrollado estrategias para la búsqueda de empleo relacionadas con las técnicas actuales más utilizadas contextualizadas al sector.",
                    "c) Se han valorado las actitudes y aptitudes que permiten superar procesos selectivos en el sector privado y en el sector público.",
                    "d) Se ha construido una marca personal identificando las necesidades del mercado actual, sus habilidades, destrezas y su aporte de valor."
                ]
            },
            {
                "id": "2",
                "description": "Aplica estrategias relacionadas con las competencias personales, sociales y emocionales para el empleo en búsqueda de la mejora de su empleabilidad.",
                "evaluation_criteria": [
                    "a) Se ha valorado la importancia de las competencias personales y sociales en la empleabilidad en el sector de referencia.",
                    "b) Se ha participado activamente en el establecimiento de los objetivos del equipo y en la toma de decisiones del mismo y asumido la responsabilidad de las acciones y decisiones del grupo, participando activamente en el logro de unos objetivos compartidos cooperando con otras personas y compartiendo el liderazgo.",
                    "c) Se han incorporado al propio proceso de aprendizaje las técnicas y recursos de presentación y comunicación, tanto orales como escritos, adecuados para una comunicación efectiva y afectiva siendo capaz de adaptarlos a cada situación y circunstancias, valorando las oportunidades y dificultades que ofrece cada una de ellas.",
                    "d) Se han aplicado técnicas y estrategias para la gestión del tiempo disponible para alcanzar los objetivos tanto individuales como del equipo y programado las actividades necesarias.",
                    "e) Se han aplicado estrategias para canalizar las emociones mostrando una actitud flexible en las relaciones con otras personas.",
                    "f) Se han desarrollado estrategias para la programación de actividades atendiendo a criterios de organización eficiente y previendo las posibles dificultades.",
                    "g) Se ha reaccionado de forma flexible y positiva ante conflictos y situaciones nuevas, aprovechando las oportunidades y gestionando las dificultades haciendo uso de estrategias relacionadas con la inteligencia emocional."
                ]
            },
            {
                "id": "3",
                "description": "Pone en práctica las habilidades emprendedoras necesarias para el desarrollo de procesos de innovación e investigación aplicadas que promuevan la modernización del sector productivo hacia un modelo sostenible.",
                "evaluation_criteria": [
                    "a) Se ha identificado el concepto de innovación y su relación con la construcción de una sociedad más sostenible que mejore en el bienestar de los individuos.",
                    "b) Se han analizado las distintas metodologías para emprender y su importancia para favorecer la innovación y como fuente de creación de empleo y bienestar social.",
                    "c) Se han aplicado las habilidades emprendedoras necesarias para promover el emprendimiento y el intraemprendimiento.",
                    "d) Se ha puesto en práctica el trabajo colaborativo como requisito para el desarrollo de procesos de innovación.",
                    "e) Se ha desarrollado la competencia digital necesaria para la mejora de los procesos de innovación e investigación aplicadas que promuevan la modernización del sector productivo.",
                    "f) Se han incorporado los objetivos de las políticas e iniciativas relacionadas con la sostenibilidad y el medio ambiente a la estrategia empresarial enfocada al desarrollo de un modelo económico y social sostenible."
                ]
            },
            {
                "id": "4",
                "description": "Identifica, define y valida ideas de emprendimiento generadoras de nuevas oportunidades a partir de estrategias de análisis del entorno socio productivo utilizando metodologías ágiles para el emprendimiento.",
                "evaluation_criteria": [
                    "a) Se han identificado los problemas de las personas destinatarias potenciales del proyecto emprendedor como paso previo a la propuesta de soluciones que se conviertan en oportunidades.",
                    "b) Se ha puesto en práctica el proceso creativo con el fin de conseguir una idea emprendedora que aporte valor económico, social y/o cultural.",
                    "c) Se ha diseñado un modelo de negocio y/o gestión derivado de la idea emprendedora.",
                    "d) Se han incorporado valores éticos y sociales a la idea emprendedora analizando modelos de balance social.",
                    "e) Se ha analizado la contribución de la Economía Circular y la Economía del Bien Común al desarrollo de un modelo económico y social basado en la equidad, la justicia social y la sostenibilidad.",
                    "f) Se han analizado los principales componentes del entorno general y específico, y su impacto en la idea emprendedora.",
                    "g) Se han realizado entrevistas de problema para validar el perfil y el problema de las personas destinatarias de la idea emprendedora.",
                    "h) Se ha validado la solución mediante la creación de prototipos buscando el encaje problema-solución.",
                    "i) Se ha experimentado con la puesta en práctica de estrategias de marketing para desarrollar destrezas en técnicas de comunicación y venta."
                ]
            },
            {
                "id": "5",
                "description": "Desarrolla un proyecto emprendedor de innovación social y/o tecnológica aplicada en colaboración con el entorno.",
                "evaluation_criteria": [
                    "a) Se han analizado los conceptos básicos del emprendimiento y la innovación social.",
                    "b) Se ha reflexionado sobre la necesidad del liderazgo ético y sostenible en las organizaciones.",
                    "c) Se ha reflexionado sobre la tecnología como base para el cambio del modelo productivo.",
                    "d) Se han puesto en marcha las estrategias propias del pensamiento de diseño para detectar necesidades sociales y medioambientales.",
                    "e) Se han analizado los elementos del diseño de modelos de negocio ecosociales y/o de base tecnológica.",
                    "f) Se han alineado metas de desarrollo sostenible con el diseño de modelos de negocio ecosociales y/o de base tecnológica.",
                    "g) Se han aplicado las estrategias necesarias para analizar la viabilidad del proyecto emprendedor.",
                    "h) Se han investigado las opciones financieras socialmente responsables.",
                    "i) Se han definido los agentes implicados en el proyecto, así como su participación en el mismo."
                ]
            }
        ],
        "contents": []
    },
    "1665": {
        "name": "Digitalización Aplicada a los Sectores Productivos",
        "code": "1665",
        "hours": "30",
        "ects": "3",
        "learning_results": [
            {
                "id": "1",
                "description": "Analiza el concepto de digitalización y su repercusión en los sectores productivos teniendo en cuenta la actividad de la empresa e identificando entornos IT (Information Technology) y OT (Operation Technology) característicos.",
                "evaluation_criteria": [
                    "a) Se ha descrito en qué consiste el concepto de digitalización.",
                    "b) Se ha relacionado la implantación de la tecnología digital con la organización de las empresas.",
                    "c) Se han establecido las diferencias y similitudes entre los entornos IT y OT.",
                    "d) Se han identificado los departamentos típicos de las empresas que pueden constituir entornos IT.",
                    "e) Se han seleccionado las tecnologías típicas de la digitalización en planta y en negocio.",
                    "f) Se ha analizado la importancia de la conexión entre entornos IT y OT.",
                    "g) Se han analizado las ventajas de digitalizar una empresa industrial de extremo a extremo."
                ]
            },
            {
                "id": "2",
                "description": "Caracteriza las tecnologías habilitadoras digitales necesarias para la adecuación/transformación de las empresas a entornos digitales describiendo sus características y aplicaciones.",
                "evaluation_criteria": [
                    "a) Se han identificado las principales tecnologías habilitadoras digitales.",
                    "b) Se han relacionado las THD con el desarrollo de productos y servicios.",
                    "c) Se ha relacionado la importancia de las THD con la economía sostenible y eficiente.",
                    "d) Se han identificado nuevos mercados generados por las THD.",
                    "e) Se ha analizado la implicación de THD tanto en la parte de negocio como en la parte de planta.",
                    "f) Se han identificado las mejoras producidas debido a la implantación de las tecnologías habilitadoras en relación con los entornos IT y OT.",
                    "g) Se ha elaborado un informe que relacione, las tecnologías con sus características y áreas de aplicación."
                ]
            },
            {
                "id": "3",
                "description": "Identifica sistemas basados en la nube (Cloud Computing) y su aplicación en el sector.",
                "evaluation_criteria": [
                    "a) Se han identificado los diferentes niveles de la nube.",
                    "b) Se han identificado las principales funciones de la nube.",
                    "c) Se ha descrito el concepto de edge computing.",
                    "d) Se han definido los conceptos de fog y mist computing.",
                    "e) Se han identificado las ventajas que proporciona la utilización de la nube."
                ]
            },
            {
                "id": "4",
                "description": "Identifica aplicaciones de la IA (inteligencia artificial) en entornos del sector donde está enmarcado el título describiendo las mejoras implícitas en su implementación.",
                "evaluation_criteria": [
                    "a) Se ha identificado la importancia de la IA en la automatización de procesos y su optimización.",
                    "b) Se ha relacionado la IA con la recogida masiva de datos (Big Data).",
                    "c) Se ha valorado la importancia presente y futura de la IA.",
                    "d) Se han identificado los sectores con implantación más relevante de IA.",
                    "e) Se han identificado los lenguajes de programación en IA.",
                    "f) Se ha descrito como influye la IA en el sector del título."
                ]
            },
            {
                "id": "5",
                "description": "Evalúa la importancia de los datos, así como su protección en una economía digital globalizada, definiendo sistemas de seguridad y ciberseguridad tanto a nivel de equipo/sistema, como globales.",
                "evaluation_criteria": [
                    "a) Se ha establecido la diferencia entre dato e información.",
                    "b) Se ha descrito el ciclo de vida del dato.",
                    "c) Se ha identificado la relación entre Big Data, análisis de datos e IA.",
                    "d) Se han descrito las características que definen Big Data.",
                    "e) Se han descrito las etapas típicas de la ciencia de datos y su relación en el proceso.",
                    "f) Se han descrito los procedimientos de almacenaje de datos en la nube.",
                    "g) Se ha descrito la importancia del cloud computing.",
                    "h) Se han identificado los principales objetivos de la ciencia de datos en las diferentes empresas.",
                    "i) Se ha valorado la importancia de la seguridad y su regulación en relación con los datos."
                ]
            },
            {
                "id": "6",
                "description": "Desarrolla un proyecto de transformación digital de una empresa de un sector relacionado con el título, teniendo en cuenta los cambios que se deben producir en función de los objetivos de la empresa.",
                "evaluation_criteria": [
                    "a) Se han identificado los objetivos estratégicos de la empresa.",
                    "b) Se han identificado y alineado las áreas de producción/negocio y de comunicaciones.",
                    "c) Se han identificado las áreas susceptibles de ser digitalizadas.",
                    "d) Se ha analizado el encaje de AD (áreas digitalizadas) entre sí y con las que no lo están.",
                    "e) Se han tenido en cuenta las necesidades presentes y futuras de la empresa.",
                    "f) Se han relacionado cada una de las áreas con la implantación de las tecnologías.",
                    "g) Se han analizado las posibles brechas de seguridad en cada una de las áreas.",
                    "h) Se ha definido el tratamiento de los datos y su análisis.",
                    "i) Se ha tenido en cuenta la integración entre datos, aplicaciones, plataformas que los soportan, entre otros.",
                    "j) Se han documentado los cambios realizados en función de la estrategia.",
                    "k) Se han tenido en cuenta la idoneidad de los recursos humanos."
                ]
            }
        ],
        "contents": [
            "Digitalización en los sistemas productivos:",
            "−\tConcepto de digitalización y transformación digital.",
            "−\tEntornos IT y OT. Diferencias y similitudes.",
            "−\tTecnologías de digitalización en planta y en negocio.",
            "Tecnologías Habilitadoras Digitales (THD):",
            "−\tIdentificación y características de las THD.",
            "−\tIoT (Internet de las Cosas).",
            "−\tRobótica colaborativa.",
            "−\tTecnología 5G.",
            "−\tRealidad Virtual y Aumentada.",
            "Sistemas basados en la Nube (Cloud):",
            "−\tConcepto de Cloud Computing.",
            "−\tNiveles y modelos de despliegue en la nube.",
            "−\tEdge Computing, Fog Computing y Mist Computing.",
            "Inteligencia Artificial (IA):",
            "−\tConcepto y aplicaciones de la IA.",
            "−\tMachine Learning y Deep Learning.",
            "−\tLenguajes de programación para IA.",
            "Datos y Ciberseguridad:",
            "−\tDato vs Información. Ciclo de vida del dato.",
            "−\tBig Data: características y almacenamiento.",
            "−\tSeguridad y protección de datos. Normativa.",
            "−\tCiberseguridad en entornos IT/OT.",
            "Plan de Transformación Digital:",
            "−\tEstrategia de transformación digital.",
            "−\tAnálisis de viabilidad.",
            "−\tRecursos humanos y capacitación digital."
        ]
    },
    "1708": {
        "name": "Sostenibilidad aplicada al sistema productivo",
        "code": "1708",
        "hours": "30",
        "ects": "3",
        "learning_results": [
            {
                "id": "1",
                "description": "Identifica los aspectos ambientales, sociales y de gobernanza (ASG) relativos a la sostenibilidad teniendo en cuenta el concepto de desarrollo sostenible y los marcos internacionales que contribuyen a su consecución. Criterios de evaluación:",
                "evaluation_criteria": [
                    "a) Se ha descrito el concepto de sostenibilidad, estableciendo los marcos internacionales asociados al desarrollo sostenible.",
                    "b) Se han identificado los asuntos ambientales, sociales y de gobernanza que influyen en el desarrollo sostenible de las organizaciones empresariales.",
                    "c) Se han relacionado los Objetivos de Desarrollo Sostenible (ODS) con su importancia para la consecución de la Agenda 2030.",
                    "d) Se ha analizado la importancia de identificar los aspectos ASG más relevantes para los grupos de interés de las organizaciones relacionándolos con los riesgos y oportunidades que suponen para la propia organización.",
                    "e) Se han identificado los principales estándares de métricas para la evaluación del desempeño en sostenibilidad y su papel en la rendición de cuentas que marca la legislación vigente y las futuras regulaciones en desarrollo.",
                    "f) Se ha descrito la inversión socialmente responsable y el papel de los analistas, inversores, agencias e índices de sostenibilidad en el fomento de la sostenibilidad."
                ]
            },
            {
                "id": "2",
                "description": "Caracteriza los retos ambientales y sociales a los que se enfrenta la sociedad, describiendo los impactos sobre las personas y los sectores productivos y proponiendo acciones para minimizarlos. Criterios de evaluación:",
                "evaluation_criteria": [
                    "a) Se han identificado los principales retos ambientales y sociales.",
                    "b) Se han relacionado los retos ambientales y sociales con el desarrollo de la actividad económica.",
                    "c) Se ha analizado el efecto de los impactos ambientales y sociales sobre las personas y los sectores productivos.",
                    "d) Se han identificado las medidas y acciones encaminadas a minimizar los impactos ambientales y sociales.",
                    "e) Se ha analizado la importancia de establecer alianzas y trabajar de manera transversal y coordinada para abordar con éxito los retos ambientales y sociales."
                ]
            },
            {
                "id": "3",
                "description": "Establece la aplicación de criterios de sostenibilidad en el desempeño profesional y personal, identificando los elementos necesarios. Criterios de evaluación:",
                "evaluation_criteria": [
                    "a) Se han identificado los ODS más relevantes para la actividad profesional que realiza.",
                    "b) Se han analizado los riesgos y oportunidades que representan los ODS.",
                    "c) Se han identificado las acciones necesarias para atender algunos de los retos ambientales y sociales desde la actividad profesional y el entorno personal."
                ]
            },
            {
                "id": "4",
                "description": "Propón productos y servicios responsables teniendo en cuenta los principios de la economía circular. Criterios de evaluación:",
                "evaluation_criteria": [
                    "a) Se ha caracterizado el modelo de producción y consumo actual.",
                    "b) Se han identificado los principios de la economía verde y circular.",
                    "c) Se han contrastado los beneficios de la economía verde y circular frente al modelo clásico de producción.",
                    "d) Se han aplicado principios de ecodiseño.",
                    "e) Se ha analizado el ciclo de vida del producto.",
                    "f) Se han identificado los procesos de producción y los criterios de sostenibilidad aplicados."
                ]
            },
            {
                "id": "5",
                "description": "Realiza actividades sostenibles minimizando el impacto de las mismas en el medio ambiente. Criterios de evaluación:",
                "evaluation_criteria": [
                    "a) Se ha caracterizado el modelo de producción y consumo actual.",
                    "b) Se han identificado los principios de la economía verde y circular.",
                    "c) Se han contrastado los beneficios de la economía verde y circular frente al modelo clásico de producción.",
                    "d) Se ha evaluado el impacto de las actividades personales y profesionales.",
                    "e) Se han aplicado principios de ecodiseño.",
                    "f) Se han aplicado estrategias sostenibles.",
                    "g) Se ha analizado el ciclo de vida del producto.",
                    "h) Se han identificado los procesos de producción y los criterios de sostenibilidad aplicados.",
                    "i) Se ha aplicado la normativa ambiental."
                ]
            },
            {
                "id": "6",
                "description": "Analiza un plan de sostenibilidad de una empresa del sector, identificando sus grupos de interés, los aspectos ASG materiales y justificando acciones para su gestión y medición. Criterios de evaluación:",
                "evaluation_criteria": [
                    "a) Se han identificado los principales grupos de interés de la empresa.",
                    "b) Se han analizado los aspectos ASG materiales, las expectativas de los grupos de interés y la importancia de los aspectos ASG en relación con los objetivos empresariales.",
                    "c) Se han definido acciones encaminadas a minimizar los impactos negativos y aprovechar las oportunidades que plantean los principales aspectos ASG identificados.",
                    "d) Se han determinado las métricas de evaluación del desempeño de la empresa de acuerdo con los estándares de sostenibilidad más ampliamente utilizados.",
                    "e) Se ha elaborado un informe de sostenibilidad con el plan y los indicadores propuestos."
                ]
            }
        ],
        "contents": []
    },
    "0156": {
        "name": "Inglés Profesional (GM)",
        "code": "0156",
        "hours": "50",
        "ects": "",
        "learning_results": [
            {
                "id": "1",
                "description": "Comprende información, de índole profesional y cotidiana, contenida en discursos orales sencillos, emitidos en lengua estándar, descifrando el contenido global del mensaje, y relacionándolo con los recursos lingüísticos correspondientes. Criterios de evaluación:",
                "evaluation_criteria": [
                    "a) Se ha situado el mensaje en su contexto por medio del análisis de sus características textuales y contextuales.",
                    "b) Se ha identificado el hilo argumental de mensajes orales y determinado los roles que aparecen en los mismos.",
                    "c) Se ha reconocido la finalidad del mensaje, ya se trate de un mensaje directo, telefónico o en cualquier otro medio auditivo.",
                    "d) Se ha extraído información específica contenida en discursos orales, en lengua estándar, relacionados con la vida social, profesional o académica.",
                    "e) Se han secuenciado los elementos constituyentes del mensaje.",
                    "f) Se han identificado y resumido con claridad las ideas principales de un discurso sobre temas conocidos, transmitido por los medios de comunicación y emitido en lengua estándar.",
                    "g) Se han reconocido las instrucciones orales y se han seguido las indicaciones siendo capaz de concluir si precisan de una respuesta verbal o de una no verbal.",
                    "h) Se ha tomado conciencia de la importancia de comprender globalmente un mensaje, sin necesidad de entender todos y cada uno de los elementos del mismo.",
                    "i) Se ha servido del análisis de la entonación y de los elementos visuales para identificar los diversos significados e intenciones comunicativas del emisor."
                ]
            },
            {
                "id": "2",
                "description": "Comprende información profesional contenida en textos escritos sencillos, analizando de forma comprensiva su contenido. Criterios de evaluación:",
                "evaluation_criteria": [
                    "a) Se han seleccionado los materiales de consulta y diccionarios técnicos. para la comprensión del texto.",
                    "b) Se han leído de forma comprensiva textos claros en lengua estándar.",
                    "c) Se ha relacionado el texto con el ámbito del sector a que se refiere.",
                    "d) Se han reconocido las ideas principales de un texto escrito identificando la información relevante, sin necesidad de entender todos y cada uno de los elementos de dicho texto.",
                    "e) Se ha identificado la terminología utilizada, así como las estructuras gramaticales y demás elementos característicos de cada tipología discursiva.",
                    "f) Se han realizado traducciones de textos en lengua estándar utilizando material de apoyo en caso necesario.",
                    "g) Se ha interpretado el mensaje recibido a través de soportes telemáticos o cualquier otro tipo de soporte.",
                    "h) Se ha reconocido la finalidad de distintos textos escritos en cualquier soporte, en lengua estándar y relacionados con la actividad profesional.",
                    "i) Se ha extraído información específica de textos de diferente naturaleza, relativos a su profesión y contenidos en distintos soportes."
                ]
            },
            {
                "id": "3",
                "description": "Produce mensajes orales sencillos, claros y estructurados, participando como agente activo en conversaciones profesionales. Criterios de evaluación:",
                "evaluation_criteria": [
                    "a) Se han determinado los registros más adecuados para la emisión del mensaje.",
                    "b) Se ha comunicado utilizando fórmulas, nexos de unión, marcadores discursivos y estrategias de interacción acordes a la situación de comunicación.",
                    "c) Se han descrito hechos breves e imprevistos relacionados con su profesión.",
                    "d) Se ha utilizado correctamente la terminología de la profesión.",
                    "e) Se han expresado sentimientos, ideas u opiniones.",
                    "f) Se han enumerado las actividades propias de la tarea profesional.",
                    "g) Se ha descrito y secuenciado un proceso de trabajo de su competencia.",
                    "h) Se ha justificado la aceptación o no de propuestas realizadas haciendo uso de normas de cortesía y de modales apropiados.",
                    "i) Se ha intercambiado, con relativa fluidez, información específica y detallada utilizando frases de estructura sencilla y diferentes soportes telemáticos.",
                    "j) Se han realizado, de manera clara, presentaciones breves y preparadas sobre un tema dentro de su especialidad, haciendo uso de los protocolos adecuados.",
                    "k) Se ha comunicado espontáneamente adoptando un nivel de formalidad adecuado a las circunstancias.",
                    "l) Se han respondido preguntas relativas a su vida socio-profesional, incluidas las propias de una entrevista de trabajo.",
                    "m) Se ha solicitado la reformulación del discurso o la aclaración de parte del mismo cuando se ha considerado necesario para una mejor comprensión."
                ]
            },
            {
                "id": "4",
                "description": "Redacta textos sencillos en lengua estándar, relacionando las reglas gramaticales con la finalidad de los mismos. Criterios de evaluación:",
                "evaluation_criteria": [
                    "a) Se han seleccionado las estrategias, estructuras, vocabulario y convenciones más adecuadas para el tipo de texto que se va a crear (fax, nota, carta o correo electrónico, entre otros).",
                    "b) Se han redactado textos breves relacionados con aspectos cotidianos y/o profesionales.",
                    "c) Se ha organizado la información de manera coherente y cohesionada.",
                    "d) Se han realizado resúmenes de textos relacionados con su entorno profesional, identificando las ideas principales de los mismos.",
                    "e) Se ha cumplimentado documentación específica de su campo profesional, aplicando las fórmulas establecidas y el vocabulario específico.",
                    "f) Se ha cumplimentado un texto dado con apoyos visuales y claves lingüísticas aportadas.",
                    "g) Se han utilizado las fórmulas de cortesía propias del documento que se va a elaborar.",
                    "h) Se ha escrito correspondencia formal básica en formato físico o digital destinada principalmente a pedir información, solicitar un servicio o llevar a cabo una reclamación u otra gestión sencilla, siempre atendiendo a las convenciones de la tipología textual.",
                    "i) Se han tomado notas, y mensajes, con información sencilla sobre aspectos propios de su labor profesional.",
                    "j) Se ha solicitado, de forma escrita, información referente a aspectos relacionados con su campo profesional (página web y correo electrónico, entre otros)."
                ]
            },
            {
                "id": "5",
                "description": "Aplica actitudes y comportamientos profesionales en situaciones de comunicación, describiendo las relaciones típicas características del país de la lengua extranjera. Criterios de evaluación:",
                "evaluation_criteria": [
                    "a) Se han definido los rasgos más significativos de las costumbres y usos de la comunidad donde se habla la lengua extranjera.",
                    "b) Se han descrito los protocolos y normas de relación social propios del país.",
                    "c) Se han identificado los valores y creencias propios de la comunidad donde se habla la lengua extranjera.",
                    "d) Se han identificado los aspectos socio-profesionales propios del sector, en cualquier tipo de texto.",
                    "e) Se han aplicado los protocolos y normas de relación social propios del país de la lengua extranjera."
                ]
            }
        ],
        "contents": []
    },
    "0179": {
        "name": "Inglés Profesional (GS)",
        "code": "0179",
        "hours": "50",
        "ects": "5",
        "learning_results": [
            {
                "id": "1",
                "description": "Comprende información, de índole profesional, académica y cotidiana, contenida en todo tipo de discursos orales, emitidos por cualquier medio de comunicación en lengua estándar, interpretando con precisión el contenido del mensaje. Criterios de evaluación:",
                "evaluation_criteria": [
                    "a) Se ha identificado la idea principal de mensajes en lengua estándar relacionados con la vida social, profesional o académica.",
                    "b) Se ha reconocido la finalidad de mensajes directos o emitidos en cualquier soporte en lengua estándar.",
                    "c) Se ha extraído información específica contenida en distintos discursos orales en lengua estándar, relacionada con la vida social, profesional o académica.",
                    "d) Se ha identificado el punto de vista y la actitud del hablante.",
                    "e) Se ha identificado el hilo argumental de mensajes orales y determinado los roles que aparecen en dichos mensajes.",
                    "f) Se han comprendido adecuadamente mensajes en lengua estándar en ambientes con contaminación acústica.",
                    "g) Se han extraído las ideas principales de conferencias, charlas e informes, y otras formas de presentación académica y profesional, lingüísticamente complejas.",
                    "h) Se ha tomado conciencia de la importancia de comprender globalmente un mensaje sin entender todos y cada uno de los elementos del mismo."
                ]
            },
            {
                "id": "2",
                "description": "Comprende mensajes escritos, de naturaleza profesional, académica y cotidiana, de relativa dificultad, analizando de forma comprensiva su contenido. Criterios de evaluación:",
                "evaluation_criteria": [
                    "a) Se ha identificado la idea principal de textos específicos de su ámbito social, profesional o académico.",
                    "b) Se ha reconocido la finalidad de distintos textos escritos en cualquier soporte, en lengua estándar y relacionados con la actividad profesional.",
                    "c) Se ha extraído información específica de textos, de diferente naturaleza, relativos a su profesión, y contenidos en distintos soportes.",
                    "d) Se ha tomado conciencia de la importancia de comprender globalmente un texto sin entender todos y cada uno de los elementos del mismo.",
                    "e) Se han leído y comprendido, de manera autónoma, textos relacionados con el sector con la velocidad y estilo de lectura propia del nivel competencial.",
                    "f) Se ha interpretado la correspondencia relativa a su especialidad, captando fácilmente el significado esencial.",
                    "g) Se han interpretado textos extensos, y de cierta complejidad, relacionados o no con su especialidad, pudiendo realizar varias lecturas del mismo.",
                    "h) Se ha identificado con rapidez el contenido y la importancia de noticias, artículos e informes sobre una amplia serie de temas profesionales.",
                    "i) Se han interpretado instrucciones, con distintos niveles de dificultad, y mensajes técnicos recibidos a través de soportes digitales.",
                    "j) Se han traducido textos de cierta complejidad, utilizando material de apoyo en caso necesario."
                ]
            },
            {
                "id": "3",
                "description": "Produce mensajes orales claros y bien estructurados, analizando el contenido de la situación y adaptándose al registro lingüístico del interlocutor. Criterios de evaluación:",
                "evaluation_criteria": [
                    "a) Se han emitido mensajes generales propios de sector y de la vida cotidiana, utilizando nexos y estrategias de interacción.",
                    "b) Se ha intercambiado con fluidez información específica y detallada utilizando estructuras de una complejidad acorde al nivel competencial.",
                    "c) Se han seleccionado y aplicado los registros adecuados para la emisión del mensaje, así como protocolos y normas de relación social propios del país.",
                    "d) Se han realizado presentaciones, bien estructuradas, sobre temas de su ámbito profesional, haciendo uso de los protocolos establecidos.",
                    "e) Se ha utilizado correctamente la terminología de la profesión.",
                    "f) Se ha descrito y secuenciado oralmente un proceso de trabajo de su competencia.",
                    "g) Se ha solicitado la reformulación del discurso o parte del mismo cuando se ha considerado necesario.",
                    "h) Se ha interaccionado espontáneamente, adoptando un nivel de formalidad adecuado a las circunstancias.",
                    "i) Se ha expresado con fluidez, precisión y eficacia sobre una amplia serie de temas generales, académicos, profesionales o de ocio, marcando con claridad la relación entre las ideas.",
                    "j) Se han expresado y defendido puntos de vista con claridad, proporcionando explicaciones y argumentos adecuados.",
                    "k) Se ha respondido a preguntas relativas a su vida socio-profesional, incluidas las propias de una entrevista de trabajo."
                ]
            },
            {
                "id": "4",
                "description": "Redacta documentos e informes, propios del sector o de la vida académica y cotidiana, relacionando los recursos lingüísticos con el propósito de los mismos. Criterios de evaluación:",
                "evaluation_criteria": [
                    "a) Se han escrito textos claros y detallados sobre una variedad de temas relacionados con su profesión, sintetizando y evaluando información y argumentos procedentes de varias fuentes.",
                    "b) Se ha cumplimentado documentación específica de su campo profesional, utilizando vocabulario específico y protocolos y normas de relación social propios del país.",
                    "c) Se ha organizado la información con corrección, precisión, con cohesión y coherencia, solicitando y/o facilitando información de tipo general o detallada.",
                    "d) Se han cumplimentado textos mediante apoyos visuales y claves lingüísticas.",
                    "e) Se han elaborado informes, destacando los aspectos significativos y ofreciendo detalles relevantes que sirvan de apoyo.",
                    "f) Se han escrito cartas, formales e informales, empleando las fórmulas de cortesía establecidas y el vocabulario específico para la elaboración de las mismas.",
                    "g) Se han resumido diferentes tipos de documentos escritos, utilizando sus propios recursos lingüísticos.",
                    "h) Se han utilizado las fórmulas de cortesía propias del documento que se va a elaborar."
                ]
            },
            {
                "id": "5",
                "description": "Aplica actitudes y comportamientos profesionales en situaciones de comunicación, describiendo las relaciones típicas características del país de la lengua extranjera. Criterios de evaluación:",
                "evaluation_criteria": [
                    "a) Se han definido los rasgos más significativos de las costumbres y usos de la comunidad donde se habla la lengua extranjera.",
                    "b) Se han descrito los protocolos y normas de relación social propios del país.",
                    "c) Se han identificado los valores y creencias propios de la comunidad donde se habla la lengua extranjera.",
                    "d) Se ha identificado los aspectos socio-profesionales propios del sector, en cualquier tipo de texto.",
                    "e) Se han aplicado los protocolos y normas de relación social propios del país de la lengua extranjera.",
                    "f) Se han reconocido los marcadores lingüísticos de la procedencia regional."
                ]
            }
        ],
        "contents": [
            "Análisis de mensajes orales:",
            "−\tComprensión de mensajes profesionales y cotidianos.",
            "−\tMensajes directos, telefónicos y grabados.",
            "−\tTerminología específica del sector.",
            "−\tIdea principal y detalles secundarios.",
            "−\tMensajes con diferentes registros.",
            "Interpretación de mensajes escritos:",
            "−\tComprensión de mensajes, textos, artículos básicos profesionales y cotidianos.",
            "−\tSoportes telemáticos: fax, e-mail, burofax.",
            "−\tTerminología específica del sector.",
            "−\tIdea principal y detalles secundarios.",
            "−\tRelaciones lógicas: oposición, concesión, comparación, condición, causa, finalidad, resultado.",
            "−\tRelaciones temporales: anterioridad, posterioridad, simultaneidad.",
            "Producción de mensajes orales:",
            "−\tRegistros utilizados en la emisión de mensajes orales.",
            "−\tTerminología específica del sector.",
            "−\tFórmulas y saludos.",
            "−\tMantenimiento y seguimiento del discurso oral.",
            "−\tMarcadores lingüísticos de relaciones sociales, normas de cortesía y diferencias de registro.",
            "Emisión de textos escritos:",
            "−\tExpresión y cumplimentación de mensajes y textos profesionales y cotidianos.",
            "−\tCurriculum vitae y soportes telemáticos: fax, e-mail, burofax.",
            "−\tTerminología específica del sector.",
            "−\tIdea principal y detalles secundarios.",
            "−\tRelaciones lógicas: oposición, concesión, comparación, condición, causa, finalidad, resultado.",
            "−\tRelaciones temporales: anterioridad, posterioridad, simultaneidad.",
            "Identificación e interpretación de los elementos culturales:",
            "−\tElementos culturales más significativos de los países de lengua inglesa.",
            "−\tNormas de conducta y protocolo.",
            "−\tRelaciones sociales y laborales."
        ]
    }
}